{
    "identifier": [
        "prevIdx",
        "chr",
        "div",
        "next_dir",
        "incr",
        "find_short",
        "maxx",
        "Result",
        "pairs",
        "su",
        "values",
        "tokens",
        "currentMax",
        "hates",
        "sz",
        "maxOp1",
        "FIRST4",
        "hmap",
        "message",
        "currentLevel",
        "ndig",
        "maxDouble",
        "LHS_parts",
        "crt_result",
        "final_list",
        "refer_dict",
        "be",
        "sorted",
        "ope_dict",
        "op_dict",
        "subresult",
        "OneOnOneRects",
        "oX",
        "dups",
        "alternate",
        "mc",
        "getans",
        "stop",
        "all0",
        "weight",
        "print",
        "high",
        "customer",
        "tableNumber",
        "level",
        "__setitem__",
        "reductions",
        "constSeg",
        "isEven",
        "tests",
        "recover_path",
        "de",
        "product",
        "header",
        "one_step",
        "n1b",
        "stdout",
        "moved",
        "traversalLst",
        "itr",
        "food_mapping",
        "lastFound",
        "even_bit",
        "inin",
        "sort",
        "new_l",
        "zfill",
        "zc",
        "r3",
        "col_table",
        "SyntaxError",
        "config",
        "gen",
        "_stringstring",
        "pattern_dict",
        "cols",
        "odd",
        "n_ar",
        "temp1",
        "remadd",
        "hex_set",
        "add_amount",
        "hr",
        "operations",
        "col_value",
        "filter",
        "mat",
        "num2",
        "resultList",
        "rev",
        "geta",
        "FUNCS",
        "seive",
        "noo",
        "case_1",
        "tree_by_levels",
        "numpy",
        "LLI",
        "board",
        "settrace",
        "int2arr",
        "dTemp",
        "masks",
        "is_end",
        "ki",
        "abs",
        "newLen",
        "list2",
        "name",
        "true",
        "operator",
        "minus",
        "orderTable",
        "alpha",
        "minSum",
        "costs",
        "ds",
        "coef",
        "fac",
        "prod",
        "res2",
        "loved",
        "mut",
        "count_ops",
        "all_tables",
        "all_foods",
        "isupper",
        "solve",
        "pattern_sub",
        "to_all_evens",
        "extras",
        "answer",
        "taken",
        "max_value",
        "currentelem",
        "ans_li",
        "width",
        "tableno",
        "new_count",
        "L1",
        "convertItemToIndex",
        "self",
        "columns",
        "store",
        "next_num",
        "table",
        "findNot",
        "eX",
        "H",
        "pel",
        "jac",
        "col_idx",
        "j2",
        "prefix_sum",
        "XYAndNode",
        "maketrans",
        "record",
        "mod",
        "half",
        "num_set_bits",
        "bits",
        "TypeError",
        "sqrta",
        "records",
        "doubles",
        "max2s",
        "keep_res",
        "count_dict",
        "b10",
        "lb",
        "running_min",
        "table_nums",
        "surplus",
        "gaps",
        "rt",
        "newlen",
        "translate",
        "has_odd",
        "prefixSum2",
        "sc",
        "k4",
        "cur_nums",
        "halv",
        "isdigit",
        "al",
        "ra",
        "tables_to_lists",
        "__next__",
        "divideCount",
        "longest_substring",
        "lmp",
        "f_alt",
        "sn",
        "ar",
        "bound",
        "new_even_num",
        "no_repeat",
        "se",
        "match",
        "titles",
        "k1",
        "seven",
        "ecj",
        "tet",
        "fst",
        "even_num",
        "tot",
        "steps",
        "minLength",
        "da",
        "divideByTwo",
        "read_input",
        "customerName",
        "floors",
        "sorting",
        "hm",
        "all_parked",
        "format",
        "h2",
        "heshion",
        "count1",
        "set",
        "out_xor",
        "word1",
        "eular_tour",
        "start2",
        "c0",
        "temp_p",
        "r_number",
        "cou",
        "sqrt",
        "current_end",
        "complete",
        "_name",
        "ain",
        "ip_parts",
        "get_print_int",
        "getLengthOfOptimalCompression",
        "div_times",
        "sampleVariance",
        "mixx",
        "repr",
        "conn",
        "MAXR",
        "iseven",
        "domi",
        "run",
        "newAboveOneIdxs",
        "footer",
        "process",
        "letter_to_int",
        "cans",
        "minops",
        "tableToIndex",
        "s_1",
        "w2",
        "tot_count",
        "tot_db",
        "ii",
        "cum_sum",
        "stc",
        "countZero",
        "hex_dict",
        "wat2",
        "state_order",
        "count_x",
        "run_len",
        "elem",
        "maxshift",
        "rec",
        "house_of_cards",
        "boo",
        "ranks",
        "seen_nonzero",
        "pi_digits",
        "sky",
        "str1",
        "default",
        "from_bytes",
        "enumerate",
        "ans_str",
        "x1",
        "isinstance",
        "maxBitLen",
        "lst",
        "new_two",
        "matched",
        "odd_flag",
        "onesCount",
        "th3",
        "multiply",
        "log2",
        "Y",
        "out",
        "oper",
        "print_s",
        "deci",
        "temp_list2",
        "calls",
        "lo",
        "visited",
        "c",
        "any",
        "flatten",
        "v1",
        "L",
        "cost",
        "count2",
        "xrr",
        "k_num",
        "qi",
        "fuck",
        "tetranacci",
        "hexkey",
        "cus",
        "newchar",
        "bigArr",
        "cum",
        "new_state",
        "IP",
        "even_str",
        "curPoints",
        "acc",
        "OneAndSome",
        "last_i",
        "get_length",
        "csbstr",
        "circle_slash",
        "tablerow",
        "B",
        "selectDish",
        "second",
        "Even",
        "postAllZero",
        "characters",
        "open",
        "min_removals",
        "tt",
        "units",
        "ls",
        "row",
        "lr",
        "table_sol",
        "longestPalindrome",
        "byteorder",
        "CodeforcesTask995ASolution",
        "nam",
        "List",
        "zip_longest",
        "noz",
        "num",
        "jacobsthal",
        "curchar",
        "bol",
        "nb",
        "strk",
        "table_num",
        "food_name",
        "graph",
        "two",
        "sodd",
        "__sub__",
        "SieveOfEratosthenes",
        "pwr2",
        "islower",
        "scores",
        "__init__",
        "Aa",
        "get_list",
        "val0",
        "return_arr",
        "sub_str",
        "even_counters",
        "primeFactors",
        "max_num",
        "dig_at_location",
        "char",
        "fun_call",
        "itemgetter",
        "longest_end",
        "po",
        "nechetnie",
        "sum_chetnie",
        "chunks",
        "char_dict",
        "unique",
        "root",
        "find_div",
        "checkDivide",
        "lprime",
        "even_arr",
        "itemIndex",
        "num1",
        "start1",
        "var",
        "dct",
        "pre_mask",
        "count_b",
        "outTable",
        "bin",
        "pred",
        "table_foods",
        "r_",
        "r_pad",
        "subres",
        "decrease",
        "DP",
        "d_ops",
        "maxb",
        "time_op",
        "MAXN",
        "table_dicts",
        "temp_res",
        "hexes",
        "len_",
        "SegmentTree",
        "done",
        "az",
        "arange",
        "alt",
        "temp_str1",
        "swap_case",
        "loadtxt",
        "maxval",
        "numOdd",
        "prevIndex",
        "Count",
        "progs",
        "nops",
        "mp",
        "min_index",
        "ln",
        "namedtuple",
        "resultArr",
        "last_count",
        "isum",
        "has_div",
        "_len",
        "bad",
        "max_m",
        "compare",
        "func",
        "unique_tables",
        "isodd",
        "count_stack",
        "min_sum",
        "max_div",
        "rev_s",
        "chars",
        "ns",
        "ll",
        "unique_dishes",
        "bit_length",
        "ctr",
        "all_zero",
        "min_col",
        "perimeter",
        "fun",
        "plus_",
        "numops",
        "y",
        "areSpecialEquiv",
        "string_letter",
        "unique_list",
        "fire_query",
        "xCopy",
        "lii",
        "end",
        "getMinAns",
        "odd_max",
        "upper",
        "all_zeros",
        "maxn",
        "bns",
        "add_count",
        "S1",
        "combinations_with_replacement",
        "reversed",
        "add_operations",
        "n",
        "dish_type",
        "array_previous_less",
        "n_op",
        "all_items",
        "orders",
        "merged",
        "kj",
        "writeln",
        "balancing",
        "idxt",
        "max_sub",
        "column",
        "t1",
        "end_state",
        "e",
        "thing",
        "msk2",
        "u",
        "output4",
        "parens",
        "div2",
        "max_mod",
        "checkIPv6",
        "get_val",
        "currPos",
        "start",
        "tmp_lst",
        "cmp",
        "list3",
        "list",
        "t",
        "cal1",
        "binascii",
        "tribonacci",
        "factorial",
        "left",
        "list_hai_bhai",
        "levels",
        "next_nums",
        "frm",
        "dlen",
        "join",
        "le",
        "r1",
        "curstr",
        "last_cnt",
        "C2",
        "C",
        "l1d",
        "initial_pattern",
        "minOperations_dumb_solution",
        "ac",
        "dn",
        "tableFreq",
        "find_in_array",
        "right",
        "maxi",
        "separator",
        "getMinRecur",
        "Solution",
        "getCost",
        "indices",
        "maxPwr2",
        "__str__",
        "lowers",
        "ib",
        "multi_max",
        "nb_op_1",
        "F",
        "corrects",
        "numzeros",
        "dec_val",
        "one_bit",
        "new_string1",
        "recurse",
        "bisection",
        "flags",
        "longest_start",
        "menu",
        "doubs",
        "tbn",
        "zero_cnt",
        "a_now",
        "dp",
        "boolean",
        "idx_from",
        "X",
        "cust_key",
        "newHull",
        "common",
        "padovan",
        "validIPv6",
        "stringcomp",
        "hex_list",
        "fill_count",
        "sd",
        "data_table",
        "op",
        "f2",
        "print_exc",
        "get_dist",
        "col_res",
        "__mul__",
        "vote",
        "log",
        "bun",
        "prefix_xor",
        "ix",
        "perform_decrement",
        "o",
        "minSteps",
        "ball",
        "Odd",
        "ed",
        "stack_str",
        "__add__",
        "noe",
        "calcOps",
        "my_dict",
        "n_mul",
        "num_zero",
        "f_order",
        "queries",
        "max_pair",
        "Fooditems",
        "RHS_parts",
        "have_odd",
        "search",
        "solution",
        "col",
        "occur",
        "new",
        "add",
        "alen",
        "VALID_WORDS",
        "encode",
        "count_of_one_steps",
        "not_zero",
        "SEQUENCES",
        "even_set",
        "occd",
        "TT",
        "la",
        "seg",
        "weights",
        "rounds",
        "s",
        "mat1",
        "curr",
        "teams",
        "divideBy2",
        "sumofprimes",
        "s_lower",
        "total",
        "rest",
        "divide",
        "th1",
        "stack_num",
        "ocj",
        "table_nos",
        "str2",
        "helper_dict",
        "pntr",
        "occurences",
        "initial",
        "LHS_to_fill",
        "get_array",
        "max_factors",
        "tree",
        "odd_parity",
        "init_cost",
        "combinations",
        "largest",
        "dic_y",
        "vis",
        "store1",
        "news",
        "verma",
        "vars",
        "deletions",
        "_become_aware_that_the_world_is_closing_in",
        "set_s",
        "sum_of_intervals",
        "h",
        "seen_set",
        "howManyPower",
        "max_col",
        "lst1",
        "currentHD",
        "cake",
        "alleven",
        "oddidx",
        "tys",
        "total_count",
        "getPow",
        "food_count",
        "sieve",
        "maxD",
        "W",
        "max_multiply_step",
        "total_subs",
        "zozonacci",
        "keep_costs",
        "lvl",
        "array",
        "q2",
        "tens",
        "LHS_chunks",
        "max_op",
        "sumOp0",
        "zero_count",
        "getenv",
        "maxA",
        "rm",
        "lstm1",
        "map",
        "decrements",
        "ad",
        "last_ch",
        "mas",
        "pos",
        "orderDict",
        "countSubstr",
        "allzero",
        "prelen",
        "mytables",
        "readline",
        "half_steps",
        "numToOps",
        "tolist",
        "wraps",
        "zzz",
        "food_set",
        "_k",
        "indx",
        "tail",
        "meeting_time",
        "frozenset",
        "acount",
        "count_r",
        "iter_count",
        "divisions",
        "maxX",
        "alph_index",
        "trance",
        "nnu",
        "two_digit",
        "repeat",
        "nMap",
        "rankTeams",
        "fat_string",
        "nato",
        "minOperations_my",
        "ROOT",
        "toAppend",
        "pot_list",
        "len",
        "num_of_letters",
        "block",
        "mi",
        "from_iterable",
        "minlen",
        "foodcounts",
        "eraseOverlapIntervals",
        "segments",
        "swap",
        "cnt1",
        "N_minus_one",
        "alphabet_indexes",
        "m1",
        "back",
        "marked",
        "ia",
        "mm",
        "output1",
        "ta",
        "BB",
        "global_changes",
        "RHS_to_fill_len",
        "count01",
        "minOperations_2",
        "third",
        "tmplst",
        "he_x",
        "d0",
        "c_mul",
        "flag",
        "NoZero",
        "order_dict",
        "DFS",
        "min_cost",
        "sorted_list",
        "known",
        "nct",
        "xored",
        "sweep",
        "fibonacci",
        "pattern",
        "minCol",
        "remain_dels",
        "superlist",
        "strings",
        "char_index",
        "poss_ops",
        "final",
        "curlen",
        "char_temp",
        "tracker",
        "nrOfOpsToZero",
        "max2",
        "countOdd",
        "foo",
        "bfs",
        "aCnt",
        "list5",
        "qu",
        "nodeset",
        "i_copy",
        "highbit",
        "x_count",
        "reverse",
        "idx",
        "pre",
        "max_match",
        "getQuery",
        "incre",
        "dex",
        "fill_count_rem",
        "filler",
        "outa",
        "b01",
        "I",
        "increase",
        "string_odd",
        "table_row",
        "multiplying_amount",
        "closing",
        "op_cnt",
        "old_num",
        "headers",
        "wts",
        "base",
        "debris",
        "Z",
        "fr",
        "switch",
        "new_even",
        "rows_number",
        "table_id",
        "compress",
        "Cost",
        "accum",
        "part_result",
        "id",
        "mo",
        "st1",
        "cycl",
        "w1",
        "p2",
        "sll",
        "EOFError",
        "w",
        "arr_list",
        "lengths",
        "moves",
        "even_parity",
        "select",
        "idx1",
        "cap2",
        "cnt",
        "shift",
        "gcd",
        "times_two",
        "op_0",
        "disp",
        "prodsum2",
        "bigger_than_zero",
        "words",
        "g",
        "validset",
        "is_keith_number",
        "testcases",
        "retvalb",
        "double",
        "minOperations0",
        "difference",
        "target",
        "calculatelen",
        "super_pad",
        "tr",
        "final_ans",
        "last_open",
        "indexes",
        "longest2",
        "dominoes",
        "mydict",
        "muls",
        "fss",
        "arg",
        "max_mul",
        "table_numbers",
        "hxnum",
        "truediv",
        "diff",
        "Exception",
        "get_dp",
        "pp",
        "sumMUL",
        "zeroIndexes",
        "addone",
        "low",
        "shape",
        "items",
        "nim",
        "functools",
        "put",
        "report_in",
        "big",
        "to_set",
        "haveList",
        "LI",
        "suffixes",
        "negc",
        "get_query",
        "longest_p",
        "xorarr",
        "sol",
        "ddx",
        "sub_times",
        "find_num",
        "get_add_mul_times",
        "first",
        "max_bits",
        "matrix",
        "sage",
        "odds",
        "add_op",
        "keta",
        "find_the_ball",
        "order",
        "tp",
        "trydel",
        "nextchar",
        "highest_bit",
        "s_intervals",
        "all_pcombo",
        "distance",
        "aa",
        "a2",
        "food_indexes",
        "my_string_2",
        "xor",
        "x3",
        "firstRow",
        "dic_hex",
        "LHS_to_fill_len",
        "cur_cost",
        "factor",
        "K2",
        "mul_count",
        "incl",
        "prev_ch",
        "x_min",
        "turn_away_from_fire",
        "ord",
        "thousands",
        "max_log",
        "init",
        "thisList",
        "yx",
        "recur",
        "lcm",
        "factorization",
        "overlap",
        "ndone",
        "fillvalue",
        "OrderedDict",
        "hxdict",
        "colTable",
        "num_div",
        "lru_cache",
        "diffs",
        "prev_end",
        "n_db",
        "alpha_cust",
        "length_count",
        "dels",
        "identity",
        "dropwhile",
        "new1",
        "one",
        "perform_dp",
        "tbl",
        "div_",
        "get_compressed_len",
        "leftMost",
        "ip",
        "factorize",
        "nm",
        "mark",
        "cp",
        "digit_len",
        "proc",
        "longest1",
        "to_ret",
        "wrapper",
        "rules",
        "counter",
        "SomeAndSome",
        "nums2p",
        "pLen",
        "msk",
        "cntb",
        "op2",
        "who",
        "mem",
        "extra",
        "hated",
        "valid_operators",
        "result2",
        "type_count",
        "bool",
        "subStrLen",
        "max_time",
        "res_stack",
        "highestBit",
        "group",
        "display",
        "calc_steps",
        "tb_disp",
        "sum_arr",
        "max_x",
        "ch",
        "test_word",
        "s_",
        "return_list",
        "parked",
        "bwa",
        "moves_left",
        "A_tmp",
        "runningPrimeSum",
        "ni",
        "save",
        "find_pn",
        "number_of_moves",
        "addOneOperations",
        "r1m",
        "groupby",
        "isIPv4",
        "xorQueries",
        "incs",
        "anss",
        "tot_inc",
        "isProgression",
        "total_weight",
        "process_task",
        "startValue",
        "prevsum",
        "_op",
        "_subtract_move",
        "tup",
        "max_half_ops",
        "dy",
        "isAllEven",
        "cd",
        "no",
        "predicate",
        "i1",
        "lstp1",
        "insert_list",
        "__",
        "xs",
        "nacci",
        "mut_count",
        "foodct",
        "getFactorList",
        "table_name",
        "prod_sum",
        "dicti",
        "blen",
        "maxLength",
        "rep",
        "xx",
        "min_column",
        "standings",
        "integer",
        "counter_correct",
        "cnta",
        "S",
        "kmax",
        "qq",
        "del_costs",
        "temp_dict",
        "__len__",
        "max_val",
        "count_odd",
        "ps",
        "latest",
        "sub_arr",
        "foodToIndex",
        "p1",
        "cal",
        "lastComplete",
        "additions",
        "z",
        "poll",
        "Matrix",
        "num_operations",
        "o1",
        "check_ind",
        "unique_food",
        "pre_xor",
        "dfse",
        "space1",
        "getCount",
        "nll",
        "iB",
        "ret",
        "alternate_sq_sum",
        "TreeNode",
        "sump",
        "min_generator",
        "quit",
        "oo",
        "input",
        "turn",
        "hexs",
        "resArr",
        "prefixArr",
        "xMin",
        "deductOdd",
        "parse",
        "chessboard",
        "nxt_idx",
        "abc",
        "needed",
        "rowSize",
        "skiprows",
        "p2length",
        "delete",
        "counter_list",
        "min_x",
        "verticalTraversal",
        "segment2Len",
        "lower_alpha",
        "mid",
        "sub_count",
        "aboveOneIdxs",
        "to_fill_len",
        "space",
        "list1",
        "os",
        "divide_all",
        "buf",
        "_right_pad",
        "stdin",
        "meals",
        "sin",
        "ones_tmp",
        "cp_lst",
        "is_divisible",
        "keys",
        "max_n",
        "tai",
        "table_idx",
        "adj",
        "numOperations",
        "locals",
        "found",
        "rxor",
        "overlaps",
        "last_pos",
        "divideByTwos",
        "ini",
        "dictionary_items",
        "traceback",
        "top",
        "resl",
        "take",
        "recDups",
        "rule",
        "cnd",
        "mul",
        "cnts",
        "intervals",
        "NameError",
        "smp",
        "single",
        "make",
        "loop",
        "res_r",
        "sumOfM",
        "real",
        "lenn",
        "max_multi_step",
        "max_",
        "ones_cnt",
        "allZero",
        "net",
        "inner",
        "delete_res",
        "maxsize",
        "lstrip",
        "backtrack",
        "markeds",
        "types",
        "strip",
        "N",
        "key",
        "tmpb",
        "flg",
        "trans",
        "dish_list",
        "adds",
        "max_nb_op_1",
        "changes",
        "state",
        "NewA",
        "bisect_left",
        "validOp",
        "md",
        "last_pos_b",
        "doublings",
        "rnums",
        "survivor",
        "bsort",
        "dig",
        "left_count",
        "px",
        "alphabet",
        "tc",
        "wt_sum",
        "table_to_dishes",
        "singlelen",
        "ct",
        "charSet",
        "string1",
        "maxt",
        "dom",
        "count_ways",
        "lim",
        "floor",
        "op1",
        "cw",
        "memo",
        "odd_counters",
        "__name__",
        "templist",
        "occ",
        "cal2",
        "gg",
        "nthterm",
        "sets",
        "nums",
        "inf_n",
        "decimal_num",
        "digits",
        "mul_maxi",
        "new_states",
        "prime",
        "x_max",
        "quota",
        "signature",
        "_center_pad",
        "max_zero",
        "used",
        "mark_next",
        "minOperations",
        "answerlist",
        "tableList",
        "boolean_to_string",
        "zcount",
        "step",
        "x2",
        "current_run",
        "outPutStream",
        "dicts",
        "pre_len",
        "c2",
        "isAllZero",
        "mapping",
        "count_zeros",
        "dist2",
        "del_c",
        "bit",
        "roman_numerals",
        "gn",
        "next_pos",
        "contagious",
        "TC",
        "setdefault",
        "child_ind",
        "inf_p",
        "candidate",
        "count_map",
        "finalStr",
        "deque",
        "l_pad",
        "corresp",
        "left_padding",
        "do_even",
        "dic",
        "div_arr",
        "brute",
        "zip",
        "removed",
        "kwargs",
        "find_gn",
        "jn",
        "average",
        "odd_set",
        "numDecodings",
        "exponent",
        "sb",
        "uptil",
        "D",
        "cases",
        "toZero",
        "accumulate",
        "sums",
        "nn",
        "log_num",
        "trim",
        "tog",
        "tableNo",
        "my_list",
        "ansr",
        "f_intervals",
        "countcall",
        "sum_count",
        "multi_step",
        "get_ints",
        "fooditems",
        "pi",
        "object",
        "dish_indices",
        "predict",
        "property",
        "terms",
        "maxDups",
        "running_length",
        "formula",
        "pre_count",
        "newstring",
        "zero",
        "cadd",
        "newString",
        "searchsorted",
        "int1",
        "j1",
        "prefixSum",
        "op_1",
        "res",
        "chg",
        "maxNum",
        "mins",
        "Union",
        "pow",
        "max_diff",
        "n_bak",
        "capslock",
        "size_arr",
        "parent",
        "totalIncs",
        "foods_list",
        "rotdig",
        "swapcase",
        "hex_num",
        "colName",
        "reads",
        "ipv4",
        "caps",
        "keep",
        "string2",
        "keepi",
        "inf",
        "right_padding",
        "get_op",
        "numSpecialEquivGroups",
        "args",
        "new_string",
        "bot",
        "temp",
        "numberOfBits",
        "min",
        "number",
        "arr2int",
        "ai",
        "cuts",
        "goal",
        "plus_one",
        "string",
        "prefixSum1",
        "bm",
        "dishes",
        "it_is_safe_to_slither",
        "nextapos",
        "cntr",
        "listt",
        "divide_count",
        "part",
        "_add",
        "string_",
        "ss",
        "keep_c",
        "list4",
        "binlen",
        "max_len",
        "o2",
        "pmask",
        "twoes",
        "RHS_total_len",
        "correct_place",
        "naive",
        "tri",
        "onetwo",
        "oci",
        "Bs",
        "tmp_0",
        "acci",
        "direction",
        "PI_DIGITS_SQUARED",
        "bwb",
        "derive",
        "primes",
        "idxm",
        "max_similarity",
        "el",
        "path",
        "ter",
        "dec",
        "run_length",
        "longest_run",
        "get_int",
        "rest_k",
        "sx",
        "limit",
        "opens",
        "newar",
        "write",
        "cv",
        "key2",
        "finaleven",
        "stacks",
        "find_children",
        "kk",
        "is_integer",
        "AllZero",
        "ddy",
        "divides",
        "G",
        "vi",
        "A_next",
        "uniquefood",
        "num_ways",
        "power",
        "cuantas",
        "maxvalue",
        "pChar",
        "lexComp",
        "read",
        "bl",
        "suma",
        "tableFood",
        "freq",
        "cin",
        "cust",
        "nextOpen",
        "hi",
        "tf",
        "bwbc",
        "popleft",
        "itarr",
        "get_result",
        "alph",
        "ans_count",
        "even_2",
        "type",
        "op_count",
        "minOpsSingle",
        "curr_power",
        "curr_node",
        "value",
        "L2",
        "s2",
        "nextFloat",
        "give",
        "jj",
        "word",
        "no_delete",
        "dictionary",
        "all_z",
        "chetnie",
        "recIncs",
        "atmpt",
        "max_index",
        "mat2",
        "ele",
        "rl",
        "_left_pad",
        "br",
        "where",
        "slowo",
        "perm",
        "zeroFlag",
        "numbers_ok",
        "mults",
        "most_freq",
        "zero_num",
        "matching",
        "li",
        "letters_indexes",
        "HELPER",
        "ck",
        "edges",
        "cap",
        "sub",
        "swaps",
        "n2",
        "table_to_food",
        "dfs",
        "makeEven",
        "whole",
        "divide2",
        "dims",
        "new_one",
        "MAP",
        "title",
        "changed",
        "re",
        "increments",
        "mx_even",
        "sum",
        "exp",
        "narr",
        "need_step",
        "token",
        "sumB",
        "stdstr",
        "leng",
        "start_end",
        "cop",
        "a_lst",
        "l2",
        "max_power",
        "dd",
        "__xor__",
        "lines",
        "stdpr",
        "turnEven",
        "lastCount",
        "u_lst",
        "hashtable",
        "candidates",
        "makeeven",
        "lengthOfLongestSubstring",
        "__truediv__",
        "round",
        "test_cases",
        "snail",
        "alist",
        "horizontal_distance",
        "merge",
        "b",
        "valid",
        "word2",
        "ASCII",
        "ht1",
        "mask",
        "operator_ok",
        "do",
        "dis",
        "a",
        "LHS_total_len",
        "foodList",
        "st",
        "tam2",
        "count_g",
        "operate",
        "food_to_idx",
        "append",
        "nodes_wo_end",
        "arr_prev",
        "n_ops",
        "totOddRem",
        "exclamations",
        "sumOfPrimes",
        "na",
        "mmax",
        "maxcnt0",
        "i",
        "r",
        "inv",
        "magic",
        "braces_status",
        "ab",
        "ascii_lowercase",
        "uf",
        "team",
        "defaultdict",
        "all",
        "total_foods",
        "capitalize",
        "odd_bit",
        "ans1",
        "ok",
        "max_divide",
        "std",
        "best",
        "allEven",
        "argmin",
        "matches",
        "remove_vowels",
        "ops_needed",
        "evens",
        "discard",
        "ary",
        "j",
        "get",
        "rotlow",
        "db",
        "ret2",
        "bracket_count",
        "inc",
        "ltr",
        "letters_count",
        "round1",
        "last_opening",
        "upp",
        "P",
        "numeral",
        "sm2",
        "y1",
        "bruteforce",
        "frequency",
        "mx",
        "res_l",
        "ind",
        "cs",
        "get_print",
        "reverse_tables",
        "maxv",
        "same",
        "opt",
        "Ta",
        "list_a",
        "find_number",
        "hp",
        "displayTable",
        "ipv6",
        "cod",
        "num_ops",
        "__author__",
        "finallen",
        "permutations",
        "height",
        "all_evens",
        "bb",
        "each",
        "sw",
        "table_dct",
        "item_list",
        "mxn",
        "food_item",
        "find_op",
        "numDec",
        "hold",
        "mr",
        "hull",
        "SEM_INF",
        "excl",
        "math",
        "run_again",
        "to",
        "pow_2_i",
        "hashmap",
        "plus",
        "arrr",
        "ANS",
        "th2",
        "comb",
        "ones",
        "c1",
        "todel",
        "fon",
        "dir",
        "fifth",
        "t2",
        "find_upper_bound",
        "dp_memo",
        "cc",
        "counts",
        "ptn",
        "x",
        "split",
        "INF",
        "hex_digit_to_dec",
        "move",
        "cpl",
        "rotate",
        "temp_str2",
        "shifted",
        "Tuple",
        "od",
        "cur_pos",
        "i_len",
        "BIT",
        "precompute",
        "setrecursionlimit",
        "max_bit_len",
        "segment",
        "build_graph",
        "pow2",
        "__import__",
        "string_even",
        "min_length",
        "AA",
        "cur",
        "FIRST",
        "getOdd",
        "PI",
        "nz",
        "replace",
        "xoraccum",
        "__getitem__",
        "max_count",
        "tb",
        "lexico",
        "num_incs",
        "symbol",
        "all_even",
        "_",
        "dancing_brigade",
        "change",
        "curr_prime_sum",
        "find_sn",
        "nos",
        "result",
        "max_pow",
        "wt",
        "rem_chars",
        "NEXT",
        "remaining",
        "max",
        "yy",
        "dish_type_count",
        "curr_diff",
        "to_bin",
        "padding",
        "parent_node",
        "multiplication",
        "paren",
        "dominoes_dict",
        "copy_ls",
        "is_hex",
        "num_steps",
        "getLengthOfOptimalCompression2",
        "bisect",
        "remainder",
        "mult_",
        "count",
        "seen",
        "result_num_div",
        "uniqueOccurrences",
        "Lmove",
        "times",
        "ints",
        "digit_char",
        "tmp_1",
        "checkOdd",
        "d2",
        "details",
        "reduce",
        "nosteps",
        "divmod",
        "currentItem",
        "next",
        "ceil",
        "ValueError",
        "sumDIV",
        "lx",
        "count_len",
        "to_add",
        "productsum",
        "memory",
        "good",
        "i3",
        "b11",
        "range_length",
        "last_char_len",
        "info",
        "ans2",
        "MAX_INF",
        "calculator",
        "minus_one",
        "fill",
        "bul",
        "bisect_right",
        "digit",
        "collection",
        "MIN",
        "divs",
        "stg",
        "maxcount",
        "s1",
        "MI",
        "pop",
        "theta",
        "q",
        "total_len",
        "fat_fingers",
        "node",
        "output2",
        "digs",
        "top_row",
        "Set",
        "next_letter",
        "others",
        "park",
        "count_occurrences",
        "ljust",
        "minCost",
        "b2",
        "anums",
        "directions",
        "cur_idx",
        "last_char",
        "sumOfN",
        "current",
        "Queue",
        "index",
        "to_continue",
        "tester",
        "WRONG_FUNC",
        "update",
        "mtup",
        "cycle",
        "sl",
        "finalodd",
        "divied2",
        "minOpt",
        "itertools",
        "bwac",
        "deleted",
        "dp_cache",
        "wj",
        "alr",
        "m",
        "maxTwos",
        "div_needed",
        "str_len",
        "max_odd",
        "trick",
        "fib",
        "op_2_cur",
        "gets",
        "ref",
        "columnTable",
        "wi",
        "val",
        "f",
        "max2Power",
        "arr1",
        "xMax",
        "gap",
        "cur_state",
        "switcher",
        "opened",
        "factorizing",
        "extra_to_append",
        "mif",
        "insert",
        "let",
        "k_lst",
        "A",
        "cur_zero",
        "numList",
        "maxtimes",
        "nf",
        "a0",
        "k",
        "GEN",
        "inp",
        "now",
        "sum_",
        "shifts",
        "adjust2power",
        "clear",
        "max_max_power",
        "calculate",
        "desk",
        "roman",
        "tables",
        "tableOrders",
        "idx2",
        "b3",
        "apos",
        "Zero",
        "U",
        "find_min",
        "zipped",
        "trees",
        "numbers",
        "pell",
        "mxr",
        "land",
        "sumADD",
        "getl",
        "meal",
        "range",
        "diff_range",
        "reduction",
        "curr_a",
        "sortedKeys",
        "hex_int",
        "hex_dic",
        "hex_convert",
        "nextInt",
        "tot_step",
        "C1",
        "initialize",
        "vposes",
        "sub_gap",
        "compressed_length",
        "baz",
        "modify",
        "cur_node",
        "sum1",
        "bitcount",
        "lt",
        "fire",
        "level_order",
        "hundreds",
        "inputarr",
        "stdint",
        "gl",
        "names",
        "oc",
        "maxCol",
        "countMap",
        "nrows",
        "skipped",
        "rectangles",
        "n1",
        "maxDoubles",
        "validIPV4",
        "pair",
        "even_res",
        "checkIPv4",
        "get_add_mut_count",
        "current_interval_end",
        "two_req",
        "next_x",
        "pSum",
        "we_are_not_done",
        "xo",
        "maxIdx",
        "head",
        "nodes",
        "fromkeys",
        "q1",
        "curr_count",
        "isnumeric",
        "overall",
        "line",
        "prev_count",
        "cunt",
        "chain",
        "length_ch",
        "omtFlag",
        "tam1",
        "RHS_chunks",
        "tal",
        "ROT135",
        "makeAllEven",
        "num_bin",
        "multiple",
        "numerals",
        "dtype",
        "pwrCnt",
        "l2d",
        "dfso",
        "queue",
        "find_odd_ops_req",
        "M",
        "one_steps",
        "findprimes",
        "Ab",
        "numDoubles",
        "h2s",
        "rows",
        "items_all",
        "k2",
        "eval",
        "streak",
        "carry",
        "dsu",
        "d_order",
        "clean_memory",
        "full",
        "foodkeys",
        "n_zeros",
        "totalOnes",
        "countPowerOfTwo",
        "hea",
        "incrs",
        "arr2",
        "mxk",
        "error",
        "mult",
        "keep_len",
        "test",
        "hstack",
        "output3",
        "divide_by_2",
        "master_list",
        "multiply_step",
        "anstr",
        "Ans",
        "peak",
        "Items",
        "bitCount",
        "variant",
        "_num",
        "del_cost",
        "rlen",
        "printArray",
        "_max",
        "alphabet_letter",
        "d",
        "can_divide",
        "del_",
        "islice",
        "wrapper_fun",
        "poly_subtract",
        "to_dec",
        "stack",
        "stk",
        "acc_lengths",
        "temp_list1",
        "oneCnt",
        "table_orders",
        "drop",
        "decimal",
        "sum_idx",
        "MAXO",
        "testCase",
        "IndexError",
        "cnt0",
        "item",
        "k3",
        "results",
        "p",
        "bruteForce",
        "lcount",
        "tl",
        "hex",
        "bi",
        "fact",
        "MAXE",
        "final1",
        "msg",
        "doubling_ops",
        "np",
        "bmod",
        "n_k",
        "doDivision",
        "report",
        "co",
        "hyperrectangularity_properties",
        "prodsum",
        "symmetric_difference_update",
        "calc_bit",
        "foodSet",
        "perform_division",
        "l",
        "sep",
        "cgen",
        "get_factors",
        "nqt",
        "tableorders",
        "clk",
        "handle_zero_nine",
        "strng",
        "en",
        "check",
        "mission",
        "findans",
        "dup",
        "candles",
        "short",
        "case_2",
        "curr_idx",
        "dataIn",
        "sys",
        "equation",
        "tab",
        "REMOVE_VOWS",
        "shortestSuperstring",
        "place",
        "last",
        "x_bin",
        "fs",
        "votes",
        "food_items",
        "count_of_half_steps",
        "list_s",
        "golomb",
        "r2",
        "compLen",
        "lol",
        "soln",
        "tableSet",
        "s_2",
        "num_mults",
        "pat",
        "minStartValue",
        "get_code_len",
        "minOperations_1",
        "l1",
        "prevstep",
        "newarr",
        "mytablefood",
        "endpoint",
        "tulu",
        "check_all_zeros",
        "longest",
        "p2D",
        "dic_x",
        "list_with_values",
        "nX",
        "calc",
        "yp",
        "lastind",
        "end_idx",
        "MEMO",
        "makeHalf",
        "ctcount",
        "it",
        "did",
        "secondString",
        "bt",
        "min_run_len",
        "shift_count",
        "ht",
        "recordset",
        "countBit",
        "coords",
        "_productsum",
        "minusCount",
        "Q",
        "s_upper",
        "BFS",
        "string2IndRes",
        "unhexlify",
        "retval",
        "KeyError",
        "v",
        "readArray",
        "resStr",
        "multiplied",
        "get_counts",
        "validIPAddress",
        "numEquivDominoPairs",
        "hashMap",
        "q3",
        "mul_max",
        "startswith",
        "newch",
        "allZeros",
        "isPrime",
        "isalpha",
        "table_result",
        "odd_res",
        "Ax",
        "fill_len",
        "Counter",
        "main",
        "maxS",
        "more",
        "nums_2",
        "newcount",
        "remove",
        "maxLen",
        "eci",
        "new_length",
        "numZeros",
        "remain_idx",
        "odd_ct",
        "halfEven",
        "ones_counter",
        "max_shift_count",
        "union",
        "brtueforce",
        "si",
        "ones_twos",
        "convert",
        "binstr",
        "even",
        "hexa",
        "ops",
        "As",
        "get_string",
        "alfabetet",
        "tn",
        "possibles",
        "fn",
        "K",
        "num_zeros",
        "find",
        "mergecost",
        "table_no",
        "odd_num",
        "hex_vals",
        "max_dev",
        "twos",
        "table_idx_to_orders",
        "tries",
        "divided",
        "Bit_num",
        "x_16",
        "MAX",
        "remain_k",
        "op0",
        "pows",
        "anslen",
        "sot",
        "liczba",
        "run_ch",
        "stack2",
        "parts",
        "int",
        "des",
        "cumArr",
        "elt",
        "lower",
        "Game",
        "cnt_divide",
        "b_len",
        "getIntArray",
        "current_start",
        "caps_lock",
        "op_2",
        "itm",
        "collections",
        "chunk",
        "RHS_to_fill",
        "meow",
        "arr",
        "lxor",
        "makeAllHalf",
        "last_row",
        "ceildiv",
        "subs",
        "T",
        "vals",
        "query",
        "add_sum",
        "odd_index",
        "hex_to_dec",
        "hb",
        "testcase",
        "my_string_1",
        "p1length",
        "code",
        "roman_string",
        "hexdigits",
        "SomeAndOne",
        "table_order",
        "statement",
        "debug",
        "square_pi",
        "factors",
        "temp_s",
        "template",
        "data",
        "dist",
        "new2",
        "zeros",
        "x_prev",
        "prev",
        "r2m",
        "tempAns",
        "category",
        "begin",
        "rr",
        "currentRoot",
        "current_changes",
        "nxt",
        "sequence",
        "extract_nodes",
        "odd_2_even",
        "MOD",
        "allzeros",
        "currentIndex",
        "i2",
        "interval",
        "float",
        "cur_multi",
        "OPS",
        "subnode",
        "tmp",
        "filtered_chg",
        "modul",
        "xors",
        "primalsum",
        "mmul",
        "ords",
        "decode",
        "foodHt",
        "max_mult",
        "prefix",
        "lastDigits",
        "food",
        "column1",
        "R",
        "foods",
        "sj",
        "remain",
        "list_with_keys",
        "mod2",
        "total_add",
        "vowel",
        "ma",
        "lexi_sum",
        "hex_digits",
        "people",
        "table_number",
        "square",
        "ix_add",
        "__starting_point",
        "str",
        "post",
        "lookup",
        "amod",
        "highestSetBit",
        "ci",
        "minus_ix",
        "ascii_letters",
        "ROMAN_VALUES",
        "rstrip",
        "geti",
        "Tb",
        "tuple",
        "size",
        "points",
        "op2_mark",
        "half_ops",
        "bin_storer",
        "next_y",
        "get_num_ops",
        "delete_count",
        "group_by_x",
        "final2",
        "end2",
        "decodeString",
        "domino",
        "sumSUB",
        "nato2",
        "ans",
        "brackets",
        "false",
        "d1",
        "maxlen",
        "normalised",
        "end1",
        "calc_x",
        "signs",
        "iA",
        "pad",
        "an",
        "isIPv6",
        "ncolumns",
        "tableID",
        "day",
        "case",
        "letter",
        "opsc",
        "translation",
        "n_repeat",
        "crt_orders_str",
        "polls",
        "dict",
        "lili",
        "pre_pos",
        "curstep",
        "cap1",
        "helper",
        "nb_op_0",
        "new_list",
        "vs",
        "nextO",
        "sm1",
        "cupc",
        "maxLmove",
        "sizes",
        "dish",
        "itemToIndex",
        "H2",
        "rem_len",
        "pn",
        "addition",
        "letters",
        "isprime",
        "int32",
        "beg",
        "shl",
        "temp_counter",
        "num_removed",
        "rot90",
        "slither_onwards_good_soldier",
        "prefix_storer",
        "max_column",
        "zeroes",
        "ri",
        "b1",
        "ip_part",
        "extend",
        "sum_dec",
        "readlines",
        "set1",
        "res1",
        "table_ints",
        "get_all_combs",
        "states",
        "letter_conversions",
        "labels",
        "MASK",
        "numreps",
        "stringlist",
        "zero_c",
        "temp2",
        "Solution1",
        "copy",
        "chartorders",
        "temp_g",
        "pw",
        "bind",
        "new_odd_num",
        "mina",
        "dev",
        "frontier",
        "k_max",
        "iter_seq",
        "mode",
        "maxmul",
        "count_zero",
        "pkey",
        "tmpa",
        "idx3",
        "num_digits",
        "maxDivideCount",
        "a1",
        "length",
        "atan2",
        "empty",
        "Tsum",
        "groups",
        "partial",
        "wat",
        "s_r",
        "nextLine",
        "ROMAN_SYMBOLS",
        "seq",
        "actions",
        "new_nums",
        "reverse_foods",
        "minVal",
        "patahBalik",
        "chk",
        "extra_cost",
        "cache",
        "rem",
        "B_tmp",
        "N_div2",
        "deletei",
        "max_doubles",
        "f1",
        "sentence",
        "pre_pos_b",
        "filtered_lst",
        "pref",
        "in_data",
        "cand",
        "eq",
        "cur_save",
        "dishesSet",
        "dx",
        "endswith",
        "inds",
        "numb",
        "n_mult2",
        "hexn",
        "s_ops",
        "parking",
        "stringa",
        "division",
        "flush",
        "manipulate",
        "n_inc",
        "places",
        "curLen",
        "sa",
        "max_i",
        "output",
        "xor_arr",
        "daa",
        "getRes",
        "sumxy",
        "V",
        "n_add"
    ],
    "integer": [
        "5623",
        "3495",
        "7030",
        "1768",
        "10291",
        "12315",
        "5986",
        "9811",
        "7540",
        "646",
        "11892",
        "1552",
        "11447",
        "9013",
        "8767",
        "3009",
        "1592",
        "11515",
        "10699",
        "11931",
        "13141",
        "200",
        "13331",
        "22",
        "12401",
        "11641",
        "13306",
        "38",
        "11908",
        "5918",
        "213",
        "8309",
        "12947",
        "4499",
        "1813",
        "1275",
        "12335",
        "12738",
        "3486",
        "7931",
        "3505",
        "2458",
        "3185",
        "7162",
        "7555",
        "9941",
        "10308",
        "11503",
        "3200",
        "5666",
        "1854",
        "7711",
        "12007",
        "7086",
        "6113",
        "8667",
        "13041",
        "2478",
        "3405",
        "5249",
        "5081",
        "12215",
        "7512",
        "726",
        "7851",
        "5462",
        "11897",
        "3499",
        "7465",
        "2102",
        "7717",
        "9174",
        "10752",
        "9984",
        "3688",
        "9832",
        "7640",
        "8464",
        "6280",
        "1338",
        "4156",
        "13035",
        "9587",
        "7646",
        "712",
        "711",
        "2671",
        "11434",
        "11869",
        "3496",
        "13421",
        "12033",
        "2718",
        "1873",
        "5193",
        "4030",
        "1954",
        "7629",
        "8462",
        "4626",
        "348",
        "6086",
        "12725",
        "8939",
        "7579",
        "8024",
        "4669",
        "13096",
        "7118",
        "7530",
        "12060",
        "3229",
        "6882",
        "1909",
        "11019",
        "4552",
        "9085",
        "5861",
        "2331",
        "864",
        "12737",
        "3841",
        "13913",
        "3687",
        "2305",
        "10018",
        "6049",
        "5496",
        "2164",
        "492",
        "7305",
        "7683",
        "2525",
        "10210",
        "7879",
        "9169",
        "12385",
        "12438",
        "10602",
        "5825",
        "7066",
        "1673",
        "3813",
        "5246",
        "7323",
        "10374",
        "13462",
        "12288",
        "12052",
        "2766",
        "9289",
        "2636",
        "10603",
        "8726",
        "8177",
        "9381",
        "13461",
        "9982",
        "8887",
        "11188",
        "4449",
        "6293",
        "7132",
        "1039",
        "9472",
        "688",
        "2128",
        "11068",
        "13062",
        "12445",
        "10103",
        "10477",
        "12350",
        "13703",
        "3071",
        "2438",
        "3307",
        "7499",
        "11142",
        "8611",
        "13247",
        "6763",
        "6326",
        "9904",
        "66",
        "11234",
        "4057",
        "3094",
        "10460",
        "2948",
        "5692",
        "9712",
        "11632",
        "5219",
        "3949",
        "37",
        "4115",
        "6643",
        "6652",
        "8814",
        "5162",
        "10945",
        "10948",
        "4482",
        "12996",
        "2444",
        "2017",
        "3119",
        "2052",
        "7328",
        "12537",
        "9517",
        "822",
        "1818",
        "7728",
        "10294",
        "5056",
        "4782",
        "12071",
        "8174",
        "1076",
        "7438",
        "5101",
        "9241",
        "10204",
        "2994",
        "214",
        "3681",
        "2207",
        "7415",
        "74",
        "8953",
        "10813",
        "4242",
