{
    "identifier": [
        "col_lower",
        "io",
        "graph",
        "guessingGame",
        "W",
        "isproductsatisfied",
        "ps",
        "smileys",
        "b_s",
        "mouths",
        "WORDS",
        "med",
        "pred",
        "ele",
        "bseven",
        "ud",
        "switcher",
        "xl",
        "dep",
        "pt1",
        "inv_fact",
        "cnt_1",
        "age4",
        "sorted_books",
        "agts",
        "MAP",
        "got",
        "genuine_c",
        "depth",
        "next_plus",
        "max_left",
        "atype",
        "yl",
        "s2",
        "DEC",
        "posNext",
        "color_points",
        "flg",
        "superPow",
        "descendList",
        "IF",
        "final7",
        "IS",
        "gl",
        "check1",
        "positive_num",
        "split",
        "new",
        "List",
        "initialArray",
        "cj",
        "thresh",
        "MENU",
        "l_out",
        "elNum",
        "sum_c",
        "xa",
        "soln",
        "listEven",
        "lt_a",
        "generator",
        "indexer",
        "age7",
        "getvalues",
        "ri",
        "prm",
        "rstrip",
        "max_idx",
        "fin",
        "abs",
        "dicta",
        "ni",
        "ch1",
        "zero_idx",
        "hollow_triangle",
        "heappush",
        "decrement_volume",
        "numEs",
        "r2",
        "zip",
        "maximum",
        "revc",
        "__starting_point",
        "content_aux",
        "next_pos",
        "CLyr",
        "num2words",
        "keys",
        "bit_length",
        "repr",
        "ascendList",
        "logical_or",
        "qc",
        "c_bool",
        "make_parent",
        "qw",
        "my_list",
        "prod",
        "is_integer",
        "c_depth",
        "l2s",
        "side",
        "ya",
        "tmax",
        "file",
        "q",
        "afts",
        "arr_k",
        "n_j",
        "prev",
        "coor_sibs",
        "per_month",
        "outa",
        "color_probability",
        "translate",
        "duff",
        "lsoint",
        "combinations",
        "primeList",
        "edges",
        "_bfs",
        "is_descending",
        "argv",
        "dct",
        "_t",
        "invalid",
        "vp",
        "parent_2kk1",
        "end",
        "second",
        "d1",
        "color_count",
        "sort2",
        "s_to_i",
        "det",
        "ball",
        "b",
        "sigma",
        "mylist",
        "not_rob_node_right",
        "unionSet",
        "dj",
        "buf",
        "p1",
        "robSub",
        "play",
        "smp",
        "points_colors",
        "ctri",
        "dhmin",
        "imax",
        "all_i",
        "cond_3",
        "vmax",
        "mp",
        "final_list",
        "five",
        "prime_product",
        "nupper",
        "threshold_in_ml",
        "mylist1",
        "casefold",
        "gosa",
        "new_str",
        "apply_query",
        "directions",
        "calendar",
        "kprv",
        "starmap",
        "is_obtained",
        "dtype",
        "ii",
        "read_int",
        "beven",
        "dp",
        "test",
        "INT",
        "CHARACTERs",
        "acc",
        "ss",
        "upper",
        "coor_bottoms",
        "heappop",
        "delta_value",
        "vstr",
        "percentage_to_ml",
        "tour_d_arr",
        "bad",
        "months",
        "a_value",
        "age5",
        "actual1",
        "mashfuck",
        "NM",
        "ak",
        "max_right",
        "seg",
        "int_to_en",
        "diff1",
        "tovisit",
        "nCr_mod",
        "matching_indexes",
        "a_l",
        "tour",
        "grouped",
        "LF",
        "d2",
        "to_sort",
        "brr",
        "idx_tuple",
        "arr",
        "peek",
        "cheaters",
        "pd",
        "rsum",
        "pmax",
        "read_case",
        "Lyr",
        "goodTriple",
        "l_arr",
        "iVFirsts",
        "is_valid",
        "arr_2",
        "right",
        "chameleons",
        "choices",
        "prev_yrs",
        "code2",
        "anslen",
        "list_d",
        "n_good",
        "num2alpha",
        "p_left",
        "ix",
        "res_len",
        "tbl",
        "false",
        "sarr",
        "layers",
        "rr",
        "reversed",
        "groupby",
        "defect1G",
        "VI",
        "counts_bigger_equal_curr_citation",
        "citations",
        "ij_pairs",
        "vmin",
        "prefix",
        "score",
        "countTriplets",
        "base5",
        "day_count",
        "middle",
        "block_end",
        "age",
        "next_term",
        "in_",
        "msg0",
        "CSize",
        "collinear",
        "progresses",
        "bin_s",
        "is_part_and_parcel",
        "maxProduct",
        "premin",
        "cnt_0",
        "age_6",
        "ILCF",
        "added_squared_list",
        "mid",
        "numPow2",
        "other",
        "bit",
        "check_b",
        "sum_d",
        "ans_next_pos",
        "ans_letter",
        "url",
        "plagis",
        "s_cost",
        "g",
        "percent",
        "nmb",
        "es",
        "key_func",
        "lenA",
        "moves",
        "Ans",
        "ANS",
        "low1st",
        "a2n",
        "ty",
        "inele",
        "outOfIndex",
        "it",
        "decoded",
        "cum",
        "nb",
        "goodPairs",
        "age_8",
        "tread",
        "sort1",
        "f2",
        "reloaded",
        "get_highest_possible_score",
        "lenb",
        "done",
        "edit_permut",
        "special",
        "true",
        "isGood",
        "posNexts",
        "toBeRoot",
        "result_string",
        "xor",
        "make_list",
        "lenAns",
        "number_converter",
        "rw",
        "EDGE",
        "uplast",
        "spread",
        "ac1",
        "lines",
        "lower",
        "length",
        "set",
        "test_matrices",
        "minV",
        "text",
        "percent_convert",
        "_bots",
        "girls",
        "sqrt_m",
        "countGoodTriplets",
        "LIST",
        "prevs",
        "largestPalindrome",
        "x",
        "age_list",
        "cc",
        "ones",
        "rb",
        "path",
        "ds",
        "word_length",
        "m1",
        "number",
        "diff3",
        "can_rob",
        "get",
        "dicto",
        "n_d",
        "hyp",
        "perc_per_day",
        "numOperations",
        "boost",
        "L",
        "readCoordinates",
        "list_a",
        "sw",
        "compu",
        "comp",
        "tour_d",
        "remove_chars",
        "populate_dict",
        "cmp",
        "step",
        "alternative",
        "isprime",
        "set1",
        "x1",
        "good_trip",
        "Tree",
        "deg1",
        "first",
        "chr",
        "ey",
        "max_can_not_shoot",
        "minalph",
        "pi",
        "rightmatch",
        "letter",
        "v2",
        "nxt",
        "coefficient",
        "move",
        "testCase",
        "water",
        "bisect",
        "final4",
        "cita",
        "_cache",
        "iSt",
        "solution",
        "iEn",
        "ranks",
        "diffs",
        "yds",
        "querys",
        "sayi",
        "linalg",
        "rmq",
        "du",
        "points",
        "fill",
        "bfts",
        "nex",
        "delete",
        "pars",
        "show",
        "read_index",
        "hIndex",
        "ct",
        "tests",
        "dp_min",
        "uvlen",
        "mx",
        "rec",
        "curmax",
        "plagplayers",
        "C_LENGTH",
        "num_in_words",
        "bot_idx",
        "yield_value",
        "pentabonacci",
        "lim1",
        "union_set",
        "empty",
        "ev",
        "kp",
        "a4",
        "a6",
        "translations",
        "hmin",
        "mh",
        "iST",
        "get_diagonale_code",
        "sgn",
        "zfill",
        "second_half",
        "uvsum",
        "ys",
        "bltf",
        "LS",
        "fmax",
        "alph",
        "Y",
        "passesMillerRabinTest",
        "wrapper",
        "a_h",
        "lowerfill",
        "csoint",
        "weird",
        "QUE2",
        "Menu",
        "streak",
        "yli",
        "oi",
        "gameOver",
        "val",
        "max_prod_left",
        "chef",
        "size_arr",
        "as_start",
        "sum_",
        "functools",
        "texture_match_number",
        "dict_b",
        "row",
        "total_good_triplets",
        "object",
        "min",
        "iter",
        "ceil",
        "cubes",
        "str_set",
        "age_7",
        "sin",
        "binascii",
        "digs",
        "num2_pots",
        "a8",
        "initial_first_step_of_j",
        "rob_node_right",
        "ar",
        "isAfter",
        "dequeue",
        "negative",
        "is_below_threshold",
        "accumulate",
        "allcol",
        "dist_uv",
        "bi",
        "MONTHS_DCT",
        "num3",
        "ot",
        "ntmp",
        "small",
        "le",
        "codes",
        "b64decode",
        "seg_el",
        "charCounts",
        "sumi",
        "fillvalue",
        "sc",
        "product",
        "res3",
        "six",
        "korfuck",
        "arrj",
        "add_edge",
        "rs",
        "TAST",
        "dcary",
        "asc",
        "pair",
        "yard",
        "self_par",
        "_i",
        "ok_b",
        "t3",
        "changer",
        "smiley",
        "modif",
        "square",
        "goodies",
        "read_str",
        "tripleIsGood",
        "lca_memo",
        "sumofages",
        "n_tri",
        "percent_change",
        "subseq",
        "dp1",
        "used",
        "_dropped",
        "base",
        "floats",
        "prod_left",
        "prtp",
        "NO",
        "term",
        "__repr__",
        "kooka_counter",
        "contentLeft",
        "que",
        "sorted_textbook",
        "prevSel",
        "strr",
        "dest",
        "getfromdictt",
        "temp",
        "b6",
        "mag",
        "aLess",
        "str_base",
        "new_string",
        "P",
        "ki",
        "sofloat",
        "value",
        "a_origin",
        "widx",
        "read_func",
        "eqcost",
        "iterative_climbStairs",
        "nm",
        "sum_no_duplicates",
        "ok",
        "process_query",
        "iIV",
        "numPermsDISequence",
        "update",
        "most",
        "arr_down",
        "isdecimal",
        "sol",
        "total",
        "sqrt",
        "maxx",
        "C_SUM",
        "range",
        "ans",
        "imin",
        "binary_search",
        "max_v",
        "dict",
        "getl",
        "each_muliply_itself",
        "is_even",
        "num_elems",
        "find",
        "output_list",
        "maxTrap",
        "recover",
        "Queries",
        "NumOfTests",
        "se",
        "lowBuffer",
        "con",
        "chunk",
        "modular_pow",
        "ls",
        "Rem",
        "SAMPLE_ANS",
        "input_tuple",
        "ydx",
        "b_bool",
        "children",
        "xe",
        "a3",
        "age_3",
        "matrix",
        "min_pos",
        "strip",
        "ic2",
        "function1",
        "min_perfect_square",
        "fermatb",
        "myf",
        "compiler",
        "next",
        "D",
        "size",
        "jk",
        "unpush",
        "islower",
        "mult_list",
        "history",
        "texture_match_list",
        "leng",
        "Yes",
        "DisjointSet",
        "parent_2kk",
        "moji",
        "log10",
        "negtive_num",
        "put",
        "nseven",
        "fibo",
        "map",
        "ILI",
        "v_queries",
        "rinput",
        "ret",
        "critical_amount",
        "min_c",
        "rows",
        "list_sum",
        "_pushed",
        "setdefault",
        "a5",
        "remain",
        "sib_idx",
        "eval",
        "determinant",
        "picks",
        "total_water",
        "leftstr",
        "f1",
        "u",
        "month_name",
        "L_1",
        "uc",
        "p2D",
        "n1",
        "triangle",
        "root",
        "sp",
        "bracket_pairs",
        "curr_max",
        "go",
        "nv",
        "later",
        "ok_c",
        "bin",
        "next_index",
        "idx",
        "lst2",
        "countB",
        "group",
        "swp",
        "tup_a",
        "age_multiplied_and_added",
        "bool_array",
        "sieve",
        "a0",
        "updates",
        "Num",
        "resolve",
        "heapq",
        "check3",
        "ELIST",
        "dpt",
        "tb",
        "ilosc",
        "rob2",
        "level_max",
        "meets",
        "further_valleys",
        "SegmentTree",
        "isPrime",
        "required",
        "_new",
        "int",
        "args",
        "min_content",
        "English",
        "currentLt",
        "arrsize",
        "KOEF",
        "testcases",
        "trans",
        "item",
        "smallalphas",
        "summ",
        "with_right",
        "phrases",
        "area",
        "e_p_d",
        "pr",
        "LCA",
        "dep_s",
        "defect2G",
        "colors_max_count",
        "need",
        "__lt__",
        "fout",
        "new_arr",
        "str_",
        "op_list",
        "countG",
        "MS",
        "res_key",
        "c_s",
        "ln",
        "strings",
        "not_found",
        "mylist2",
        "vsum",
        "goods",
        "tolist",
        "ng",
        "listtemp",
        "loc_min",
        "takewhile",
        "main0",
        "not_rob_root",
        "vc",
        "maxlen",
        "N0",
        "sk",
        "LI",
        "deq",
        "half1",
        "goodA",
        "odd",
        "maxLeft",
        "max_colored",
        "initial_last_step_of_i",
        "s_visited",
        "rounding",
        "intx",
        "ij_idx",
        "stk",
        "firstVisited",
        "ma",
        "csofloat",
        "op",
        "lim2",
        "mozi",
        "lookup",
        "original",
        "itr",
        "qk",
        "var1",
        "tri",
        "revArrS",
        "task",
        "plgrsm",
        "listsplit",
        "SAMPLE_IN",
        "arrange",
        "CL",
        "ord_a",
        "operation_func",
        "counts_1",
        "ysmm",
        "isRoot",
        "th",
        "alpha_list",
        "process",
        "limit",
        "b_string",
        "cur_len",
        "sumo",
        "lru_cache",
        "s",
        "first_half",
        "perc",
        "turn_off_level",
        "vis",
        "target_games",
        "minHeight",
        "long_prifix",
        "da",
        "np",
        "v_par",
        "ipt",
        "n2a",
        "dec",
        "st",
        "k1",
        "euler_tour",
        "ascii_lowercase",
        "vol",
        "listik",
        "sliced",
        "penta_fib_table",
        "lp",
        "stop",
        "R",
        "__call__",
        "scramble",
        "threshold",
        "read_values",
        "arrdsc",
        "set_indicators",
        "max_level",
        "lstrip",
        "trappable",
        "string_of_number",
        "BG",
        "total_width",
        "solve_case",
        "arr_up",
        "did_we_win",
        "printe",
        "case",
        "el",
        "id_",
        "results",
        "maxNeg",
        "pwrOfTwo",
        "age3",
        "geti",
        "ascii_letters",
        "pj",
        "abc",
        "num_good_triplets",
        "nind",
        "permut",
        "den",
        "compares",
        "color_triangle_count",
        "rest",
        "bottom",
        "child",
        "hatsu",
        "get_empty_per_level",
        "new_s",
        "incrs",
        "absolute",
        "has_parent",
        "to_meet",
        "getValue",
        "unum",
        "deletes",
        "odd_terms",
        "msg1",
        "q_evap_per_day",
        "edge_set",
        "qq",
        "id",
        "strDir",
        "len_s",
        "strX",
        "drop_max",
        "number_string",
        "costs",
        "trsh",
        "disp",
        "laughing",
        "perc_th",
        "LTOS",
        "round_answer",
        "zero",
        "init",
        "maxsize",
        "M0",
        "remadd",
        "multiply",
        "curmin",
        "query",
        "QUE",
        "remove",
        "inp",
        "b_l",
        "dx",
        "values",
        "l2",
        "h",
        "one",
        "default",
        "read_lines",
        "a_or_d",
        "lt",
        "hs",
        "ic_min",
        "cheffun",
        "ree",
        "MOVES",
        "ncol",
        "b2",
        "rob1",
        "fv",
        "crossProd",
        "u_idx",
        "cx",
        "tp",
        "superrob",
        "cycle",
        "pre",
        "shape",
        "dya",
        "xyz",
        "apple",
        "steps",
        "grp",
        "stacks",
        "pointer2",
        "opt",
        "arr_i",
        "ageList",
        "list4d",
        "reduce",
        "makeSet",
        "elem_list",
        "tot",
        "ans_len",
        "vnum",
        "inputs",
        "qi",
        "heights",
        "checkGood",
        "write",
        "prev_level",
        "cmd",
        "win",
        "min1",
        "xyuv",
        "listOdd",
        "character",
        "times",
        "code",
        "walk",
        "sorted_ci",
        "dxs",
        "isContinuing",
        "waterTrapped",
        "with_left",
        "md",
        "e",
        "aSev",
        "func",
        "ages1",
        "tup",
        "total_triplets",
        "Error",
        "len",
        "f",
        "key",
        "pot_num2",
        "minDeletionSize",
        "pref",
        "lsofloat",
        "gets",
        "text_books",
        "jk_pairs",
        "v_to_i",
        "leftMaxima",
        "a_s",
        "tmp_dists",
        "w",
        "first_idx",
        "rl",
        "COST",
        "i1",
        "ary0",
        "I",
        "without_left",
        "substring_set",
        "AST",
        "bisect_right",
        "flipleftmatch",
        "terms",
        "rob",
        "aFor",
        "count_0",
        "itertools",
        "goodcount",
        "all_triplets",
        "board",
        "Exception",
        "thresholdper",
        "mouth",
        "MAX",
        "min_p",
        "step5",
        "match",
        "starting_list",
        "condition2",
        "iinput",
        "vv",
        "ints",
        "dep_l",
        "read_lists",
        "chain",
        "od",
        "dxe",
        "fibonacci",
        "find_repeat",
        "function",
        "non_elig",
        "in_k",
        "dfs1",
        "TypeError",
        "stdout",
        "delNodes",
        "decode_adfly",
        "gcount",
        "digits",
        "dict_keys_sort",
        "lsum",
        "Solution",
        "sumf",
        "books",
        "EULER",
        "right_yield_f",
        "thresh_quant",
        "diff2",
        "Numy",
        "DEPTH",
        "other_color",
        "K",
        "B",
        "first_appear",
        "dis",
        "left_yield_t",
        "ans_size",
        "cond_2",
        "point_list",
        "level",
        "Query",
        "dont_take",
        "setInit",
        "dirTable",
        "phi",
        "decorated_trees",
        "xy",
        "square_root_result",
        "arrS",
        "ic",
        "isOdd",
        "nx",
        "helper",
        "l2d",
        "count_",
        "real_cnt1",
        "k",
        "nextmag",
        "block_start",
        "condition",
        "age_2",
        "read_str_list",
        "elig_scholar",
        "dS",
        "q_threshold",
        "goal",
        "fours",
        "stg",
        "mc",
        "lrd",
        "ik_count",
        "__init__",
        "texture",
        "depth_u",
        "descending",
        "Edges",
        "recurse",
        "all_char_sequence_start_pos",
        "overall",
        "squared",
        "my_sort",
        "total_dist",
        "LOG_N",
        "ops",
        "tup_list",
        "array_n",
        "lower_case_textbooks",
        "n_day_expire",
        "cond_1",
        "initial_volume",
        "combs",
        "LI_",
        "ROUND_DOWN",
        "non_subseq_len",
        "dv",
        "part_cheat",
        "max_n",
        "b_f",
        "is_sorted_and_how",
        "cup_volume",
        "intersection",
        "USED",
        "partial",
        "r1",
        "g1",
        "STONES",
        "bans",
        "new_tovisit",
        "front",
        "get_order",
        "item1",
        "setrecursionlimit",
        "prob_mapper",
        "lnew",
        "tt",
        "parent_to_root",
        "chef_val",
        "_d",
        "is_triangle",
        "book",
        "increment",
        "cur_op",
        "as_a_perfect_square",
        "arg",
        "menu",
        "dist",
        "base_parity",
        "a_string",
        "ac2",
        "critical",
        "coor",
        "IINF",
        "temp2",
        "attempt1",
        "rightMaxima",
        "notOnSameLine",
        "curr_delete",
        "startswith",
        "swapcase",
        "width",
        "push",
        "scount",
        "b0",
        "right_p",
        "m0",
        "n_i",
        "popitem",
        "log",
        "prt",
        "suma",
        "is_square",
        "cpts",
        "al",
        "wsum",
        "uvnum",
        "new_content",
        "korabel",
        "new_ages",
        "coef",
        "link",
        "op_counter",
        "A2",
        "boo",
        "solns",
        "max_term",
        "ny",
        "textbook",
        "countGoodTripletsCase2",
        "LLI",
        "H",
        "ik_ids",
        "midpoint",
        "nc",
        "cumadds",
        "total_count",
        "comb1",
        "number_word",
        "drop_min",
        "geven",
        "_binOpe",
        "defectG",
        "cost",
        "fromkeys",
        "getenv",
        "l_results",
        "ran",
        "e0",
        "prod_right",
        "findSet",
        "alpha_list_last",
        "in_i",
        "sums",
        "xli",
        "fact",
        "aa",
        "MONTHS",
        "db",
        "digit",
        "Numz",
        "iVColors",
        "eight",
        "comb_points",
        "os",
        "No",
        "isScramble",
        "is_substr",
        "tks",
        "sofloats",
        "counter_",
        "alphabetlist",
        "encoding",
        "time",
        "old_level",
        "lenArray",
        "cnt",
        "translation",
        "cand",
        "curr",
        "position",
        "printi",
        "br",
        "cmp_to_key",
        "components",
        "num1",
        "YES",
        "soints",
        "MAXP",
        "goodTriplet",
        "eular",
        "ex",
        "par",
        "k_string",
        "genRail",
        "lastap",
        "hmax",
        "array",
        "j2",
        "maxi",
        "stringNum",
        "preplayers",
        "LINF",
        "rightstr",
        "lennew",
        "wordLen",
        "TreeNode",
        "qv",
        "mn",
        "maxPos",
        "a1",
        "type",
        "collide_coord",
        "nearest",
        "books_lowcase",
        "defect1B",
        "todo",
        "a_dict",
        "avg",
        "l_in",
        "PRIMES_LIST",
        "good_triplet_count",
        "matched",
        "afour",
        "maxthresh",
        "check2",
        "four",
        "__class__",
        "return_arr",
        "days",
        "xi",
        "gans",
        "climbStairs",
        "SegmentTree1",
        "age_4",
        "box",
        "s_vertex",
        "lcm",
        "lcs",
        "minind",
        "pv",
        "sz",
        "la",
        "ch",
        "nt",
        "sb_primes",
        "arr_dict",
        "best",
        "currH",
        "sm",
        "rsplit",
        "rob_node_left",
        "available_left_arrow",
        "aseven",
        "reverse",
        "chakra",
        "boys",
        "counter",
        "dict_c",
        "buckets",
        "anss",
        "length_of_number",
        "num_queries",
        "LENG",
        "repetitive",
        "math",
        "depth_list",
        "rob_root",
        "result",
        "getdiff",
        "psum",
        "word",
        "compress",
        "upperfill",
        "adFly_decoder",
        "depth_from_root",
        "char",
        "lor",
        "l_rem",
        "removeDuplicates",
        "a_m",
        "data",
        "make_get_patterns",
        "yummy",
        "allow",
        "percent_of_content",
        "sqrt_n",
        "numberOfBars",
        "sc1",
        "mod",
        "last_odd",
        "letter_idx",
        "res2",
        "root_deleted",
        "open_indexes",
        "condition3",
        "cf",
        "lt_c",
        "chars",
        "distNew",
        "putindictt",
        "den2",
        "findall",
        "_content",
        "vidx",
        "good_count",
        "bisect_point",
        "col",
        "min_v",
        "c",
        "color_appear",
        "parent_delete",
        "euler_depth_topo",
        "fw",
        "msg",
        "ns",
        "V",
        "point_count",
        "min_len",
        "DP",
        "EPR",
        "stack",
        "pointer3",
        "table",
        "check_c",
        "binpow",
        "weight",
        "searchsorted",
        "largestproduct",
        "ca",
        "calc_min_len",
        "odd_digs",
        "color",
        "leftmaxes",
        "bfs",
        "arr_len",
        "fin7",
        "defectB",
        "distance_from_root",
        "depths",
        "get_set",
        "analyze",
        "smallest",
        "filllower",
        "aux",
        "offset",
        "parent_deleted",
        "ne",
        "lt_b",
        "contains",
        "max_count",
        "age_multiplied_and_added_and_squared",
        "mm",
        "ancestor",
        "x47",
        "divisor",
        "accend_Counter",
        "rightmaxes",
        "pop",
        "my_parse_int",
        "monity",
        "appendleft",
        "ohh",
        "chameleon",
        "ans2",
        "block",
        "splitlines",
        "qu",
        "popleft",
        "posChars",
        "cs_color",
        "plst",
        "percent_loss",
        "new_state",
        "smiles",
        "even",
        "di",
        "coord",
        "no",
        "max1",
        "clr",
        "get_max_prod",
        "instructions",
        "des_arr",
        "volume_threshold",
        "low",
        "dq",
        "top",
        "ele_id",
        "textbooks",
        "loc_max",
        "new_level",
        "fillupper",
        "qs",
        "color_distance",
        "goodtriplets",
        "discard",
        "timeElapsed",
        "penta_fib",
        "initial_last_step_of_k",
        "colored_triangles",
        "__doubling",
        "v_root",
        "req",
        "rail",
        "node",
        "b64encode",
        "clear",
        "down",
        "a_f",
        "ye",
        "numbers_words",
        "bc1",
        "sumtri",
        "url_adfly",
        "binary_strings",
        "qn",
        "nd",
        "most_count",
        "enc",
        "order",
        "GregAndArray",
        "rob_node",
        "currentCount",
        "check",
        "__n",
        "acc_p",
        "X",
        "readIn",
        "circle",
        "divmod",
        "pos_i",
        "euler_tour_dfs",
        "repeat",
        "st1",
        "na",
        "queries",
        "brackets",
        "eyes",
        "sorted_textbooks",
        "find_set",
        "extend",
        "dfs",
        "valid",
        "ts",
        "ind_2",
        "desc",
        "Stack",
        "min_time",
        "bag_content",
        "LCES",
        "opened",
        "arrLen",
        "hot",
        "loop",
        "bLess",
        "lst_books",
        "totallen",
        "sorted_desc",
        "edge",
        "j1",
        "tasks",
        "iter_primes",
        "defaultdict",
        "apnum",
        "mkP",
        "qsize",
        "actual_generator",
        "arange",
        "make_set",
        "suff",
        "Counter",
        "aj",
        "minlen",
        "dc",
        "cut",
        "sb",
        "pledged",
        "dys",
        "subject",
        "c_f",
        "switch",
        "levels",
        "Queue",
        "cB",
        "loc",
        "without_right",
        "sevens",
        "not_rob_node_left",
        "n3",
        "operations",
        "bottom_count",
        "__dfs",
        "kk",
        "greatest",
        "let",
        "dict_a",
        "rise",
        "gen_st",
        "inf",
        "construct",
        "seen2",
        "data_init",
        "dd",
        "lucky10",
        "temp1",
        "stone_bridge_primes",
        "marble",
        "not_useful",
        "lo",
        "property",
        "geta",
        "defect2B",
        "cs",
        "sum_mult",
        "message",
        "all_ages",
        "open",
        "ci",
        "age_sm",
        "square_root",
        "appeard",
        "links",
        "next_position",
        "formatter",
        "magic",
        "num_ops",
        "stdin",
        "randint",
        "bs",
        "cA",
        "min_size",
        "item3",
        "prime",
        "cur_dir",
        "target",
        "roots",
        "percentage",
        "least_common_ancestor",
        "sublist",
        "dfsc",
        "INC",
        "int_s",
        "decend_Counter",
        "big",
        "words",
        "room_number_list",
        "last_even",
        "_fa",
        "get_father",
        "age8",
        "mydic",
        "LA",
        "rev",
        "decrement",
        "sum2",
        "cnt_c",
        "ages",
        "textbooks_low_sorted",
        "next_char_pos",
        "b7",
        "num_str",
        "side_len",
        "top_idx",
        "age6",
        "A",
        "new_sorted_list",
        "err",
        "check_a",
        "hold",
        "ax",
        "abcd",
        "kdx",
        "tr",
        "co",
        "read_int_list",
        "penta_fib_i",
        "desiredColor",
        "exp",
        "flag",
        "mini",
        "charc",
        "switch_it_up",
        "qid",
        "dft",
        "compile",
        "Node",
        "bag",
        "is_ascending",
        "info",
        "cr",
        "sys",
        "dictionary",
        "list2d",
        "topR",
        "soldiers",
        "state",
        "ch2",
        "poss",
        "l",
        "initial_first_step_of_i",
        "threshold_vol",
        "PROBS",
        "fn",
        "month",
        "numbers",
        "restNums2",
        "nlower",
        "thrshld",
        "adjL",
        "__logn",
        "loc_list_last",
        "result_add",
        "predmet",
        "iterator",
        "memo",
        "inc",
        "list3d",
        "format",
        "__parents",
        "ml",
        "color_match_number",
        "iterate",
        "gr",
        "newAge",
        "readlines",
        "base64",
        "to",
        "i2",
        "deleteSet",
        "passup",
        "coeff",
        "letters",
        "replace_left",
        "clean_order",
        "MIT",
        "gp",
        "int1",
        "removeat",
        "code1",
        "PEDPS",
        "is_empty",
        "primes",
        "parity",
        "stored",
        "typ",
        "parent_2k",
        "alphabet",
        "power",
        "queue",
        "j",
        "LIS",
        "bc2",
        "de_start",
        "t_copy",
        "additionals",
        "readline",
        "lca_uv",
        "ob",
        "age1",
        "var2",
        "ascending",
        "inner_list",
        "vector",
        "compute",
        "vb",
        "goodB",
        "dups",
        "strY",
        "bot",
        "max_input",
        "face",
        "yd",
        "grad",
        "tri_print",
        "output",
        "Numx",
        "plain",
        "sorted",
        "CD",
        "calcNext",
        "make_get_pattern",
        "add",
        "arr1",
        "l1d",
        "integerX",
        "l1",
        "count_odd_pentaFib",
        "prv",
        "max",
        "alpdic",
        "min_idx",
        "pointer1",
        "find_missing",
        "wnum",
        "make_triangle",
        "INF",
        "sep",
        "evaporator",
        "fb",
        "total_cost",
        "ind_1",
        "new_len",
        "decompose",
        "lb",
        "sort_arr",
        "ILCI",
        "num",
        "pos",
        "temperature",
        "jk_count",
        "sorter",
        "Q",
        "encoded",
        "answer",
        "lr",
        "ai",
        "__",
        "updated_a",
        "i_max",
        "bLesS",
        "xs",
        "dp2",
        "convert",
        "isGoodTriplet",
        "ILLF",
        "st_rmq",
        "s_age",
        "read_ints",
        "Cil",
        "idEle",
        "n_cases",
        "Qs",
        "found",
        "used_m",
        "triplet",
        "allEven",
        "numGoodTrips",
        "strng",
        "random",
        "specials",
        "mod2",
        "counter_days",
        "num_cmds",
        "test_cases",
        "npres",
        "pts",
        "edx",
        "val_to_add",
        "v_need",
        "name",
        "cday",
        "c1",
        "fmin",
        "bgts",
        "pl",
        "grabit",
        "sorted_asc",
        "m2",
        "dye",
        "condition1",
        "repeats",
        "last_ch",
        "vertex",
        "floor",
        "fliprightmatch",
        "main",
        "swaureroot",
        "kwargs",
        "checked",
        "sides",
        "Figure",
        "dat",
        "v_next",
        "ly",
        "vs",
        "L2",
        "iy",
        "dists",
        "v1",
        "topNum",
        "idx2",
        "quantize",
        "npos",
        "stderr",
        "is_root",
        "input_",
        "new_sorted_list_d",
        "perc_evap",
        "list1",
        "no_terms",
        "rjust",
        "checkmagic",
        "step4",
        "n_k",
        "T",
        "compare",
        "start",
        "encoded_url",
        "without_root",
        "numberOfCases",
        "ks",
        "re",
        "lns",
        "sch",
        "locker_run",
        "this_permut",
        "seen",
        "itr_range",
        "title",
        "LV",
        "register",
        "ncolor",
        "Nxt",
        "cD",
        "zip_longest",
        "barHeights",
        "common",
        "lret",
        "coor_tops",
        "starter",
        "cnt1_max",
        "_stables_min",
        "val3",
        "squares",
        "last_idx",
        "tree",
        "eye",
        "v_idx",
        "s_new",
        "__import__",
        "is_in",
        "modStr",
        "print",
        "options",
        "lower_case_textbook",
        "current_volume",
        "log2",
        "E",
        "delta",
        "from_idx",
        "m_div",
        "squared_list",
        "speed",
        "find_outlier",
        "elements",
        "memmax",
        "start_",
        "perm",
        "iV",
        "parentk",
        "modulus",
        "b64",
        "play_dist",
        "with_root",
        "nweight",
        "conditions",
        "m_d",
        "permut_list",
        "t",
        "ls1",
        "MI",
        "dict_",
        "calc_max_len",
        "Cfl",
        "expression",
        "subword",
        "IndexError",
        "__str__",
        "__bool__",
        "extra",
        "findStr",
        "items",
        "accD",
        "ind",
        "EVEN",
        "dk",
        "new_list",
        "meet_left",
        "a_count",
        "figure",
        "seq",
        "shortest",
        "sort",
        "e_url",
        "seven",
        "capitalize",
        "n",
        "left",
        "nvalue",
        "index",
        "__sub__",
        "et",
        "nelio",
        "grid",
        "luck_check",
        "cdist",
        "content",
        "each",
        "dic",
        "left_yield_f",
        "cur_pos",
        "sum1",
        "current",
        "where",
        "schedule",
        "stackChildren",
        "tx",
        "LIMIT",
        "NameError",
        "isdigit",
        "__depth",
        "lca",
        "new_int",
        "filter",
        "next_ch",
        "_trips",
        "three",
        "decodeStr",
        "sq",
        "oK",
        "round",
        "rret",
        "PRIMES",
        "maps",
        "dict_nums",
        "qpow",
        "a7",
        "Book",
        "minP",
        "ll",
        "bFor",
        "high",
        "enqueue",
        "merge",
        "prob",
        "i3",
        "bisect_left",
        "count_smileys",
        "cnt1",
        "str1",
        "modifiedArray",
        "target_game",
        "max_val",
        "any",
        "resp",
        "unicodedata",
        "rt",
        "int_list",
        "countAtleast",
        "sn",
        "alpha2",
        "d3",
        "dictt",
        "dctTriangles",
        "lst1",
        "exponent",
        "EOFError",
        "S",
        "new_roots",
        "PREFIX",
        "marbles",
        "delete_nodes",
        "lstindx",
        "yards",
        "zz",
        "integers",
        "v3",
        "count_col_triang",
        "needed",
        "sumD",
        "swap",
        "_dfs",
        "BLM",
        "usum",
        "s1",
        "answers",
        "even_digit_squares",
        "we",
        "fa",
        "two",
        "str",
        "binary",
        "cou",
        "triplets",
        "bSev",
        "rows_number",
        "EulerTour",
        "bcount",
        "oldAge",
        "grille",
        "url_encoded",
        "mat",
        "coor_neighbor",
        "og",
        "duplicate_encode",
        "min_key",
        "b_m",
        "list2",
        "plays",
        "fac",
        "ic1",
        "sbp",
        "staticmethod",
        "n_color",
        "sa",
        "LEN",
        "content_pct",
        "alp_to_n",
        "skip",
        "recon",
        "sequence",
        "subjects",
        "REG_CMD",
        "hasAllCodes",
        "dxa",
        "citation",
        "string",
        "m",
        "testbooks_sorted_indexes",
        "powOf5",
        "vals",
        "ind_3",
        "_",
        "sc2",
        "all",
        "lastindex",
        "is_subsequence",
        "t1",
        "count_1",
        "type_arr",
        "n_max",
        "valMap",
        "Best",
        "maxUse",
        "__E",
        "res",
        "can",
        "alp",
        "AssertionError",
        "leftmatch",
        "lx",
        "zeros",
        "list_to_str",
        "sum_ages",
        "run",
        "sort_desc",
        "MOD",
        "_coors",
        "te",
        "read",
        "age_5",
        "tc_",
        "lmp",
        "exist",
        "kooks",
        "temp_s",
        "vertices",
        "dif",
        "NE",
        "ij",
        "max_cost",
        "decode",
        "ctr",
        "dfs2",
        "rindex",
        "layer",
        "triples",
        "stri",
        "has_sub",
        "bin_value",
        "js",
        "count",
        "daily_content",
        "xrange",
        "isAllNeg",
        "__ge__",
        "idx1",
        "soint",
        "yindex",
        "copy",
        "MaxM",
        "predict_age",
        "lockers",
        "ti",
        "DIRS",
        "lis",
        "comb",
        "parent1",
        "numSquares",
        "pc",
        "QS",
        "max_p",
        "countGoodTripletsCase1",
        "b_h",
        "half2",
        "v",
        "numEle",
        "norm",
        "__le__",
        "ENGLISH_NUMBE_NAMES",
        "subj",
        "deleting",
        "encode",
        "npnt",
        "va",
        "attempt2",
        "Decimal",
        "sign",
        "subAnsSet",
        "print_s",
        "n2",
        "MGN",
        "full",
        "duplicates",
        "check_challenge",
        "__dist",
        "coors",
        "counts",
        "input",
        "rd",
        "initial_first_step_of_k",
        "Main",
        "nfour",
        "b4",
        "C",
        "maxCita",
        "action",
        "t2",
        "threePts",
        "d",
        "pt2",
        "num2words1",
        "ILLI",
        "amountevaporated",
        "lengthOfSet",
        "mPow2",
        "d_next",
        "evens",
        "bfour",
        "beauty",
        "perct_evp",
        "sum",
        "room_number_set_sum",
        "wordList",
        "pu",
        "_query",
        "isPossible",
        "numQueries",
        "glo_max",
        "newA",
        "locals",
        "aLesS",
        "sorted_arr",
        "good_triplets",
        "list",
        "ok_a",
        "accum",
        "IDX",
        "_stables_max",
        "pattern",
        "toadd",
        "siz",
        "countGreater",
        "alphanum",
        "totalsteps",
        "data_dict",
        "d_color",
        "dy",
        "height_differences",
        "sochef",
        "initials",
        "currentpow",
        "near",
        "solve",
        "minimum",
        "first_step_of_k",
        "result_t",
        "join",
        "bytes",
        "nine",
        "union",
        "isAllPos",
        "des",
        "logical_and",
        "alpha2num",
        "day",
        "times_query",
        "o",
        "day_counter",
        "triangle_count",
        "noses",
        "val2",
        "narcissistic",
        "bb",
        "make",
        "n_col",
        "my_dict",
        "room_number_set",
        "treshold",
        "_prod_cache",
        "multi_level_count",
        "initialize",
        "per_",
        "pa",
        "q_t",
        "initial_last_step_of_j",
        "tuple",
        "make_nCr_mod",
        "p",
        "_tops",
        "f_colorful_tree",
        "prime_set",
        "bool",
        "pow",
        "adfly_url",
        "nums",
        "makeSegTree",
        "line2",
        "depth_lca",
        "amount_remaining",
        "best_max",
        "applied",
        "arr_j",
        "rem",
        "arr_asc",
        "euler_depth_real",
        "sum_so_far",
        "smallestproduct",
        "maketrans",
        "max_no",
        "ary",
        "append",
        "tmp2",
        "cache",
        "textbooks_low",
        "goodTriplets",
        "deque",
        "altf",
        "iorig",
        "colored",
        "to_delete",
        "a_bool",
        "set_ancestor",
        "combos",
        "r_arr",
        "l_bounds",
        "tmp",
        "get_first",
        "right_yield_t",
        "s_stored",
        "vectorize",
        "primes_set",
        "lower_case",
        "leg",
        "flags",
        "get_temp",
        "get_lca",
        "grand_secret",
        "stone",
        "candidates",
        "flip",
        "drop",
        "n_",
        "sqw",
        "mi",
        "what",
        "step3",
        "cl",
        "list_sum2",
        "iMinV",
        "total_days",
        "colors",
        "ntoa",
        "b1",
        "age2",
        "trees",
        "m_value",
        "depth_v",
        "iVColorss",
        "vNow",
        "ILF",
        "topC",
        "k2",
        "SEG",
        "num2",
        "sumDs",
        "number_map",
        "insert",
        "N_q",
        "pn",
        "isinstance",
        "enumerate",
        "valleys",
        "evap_per_day",
        "epd",
        "odd_penta_fib",
        "dp_max",
        "nose",
        "a",
        "i0",
        "adFly_encoder",
        "max_streak",
        "r",
        "II",
        "U",
        "converter",
        "newstr",
        "fib",
        "now",
        "contentRemaining",
        "i_min",
        "bins",
        "ge",
        "cumadd",
        "max_len",
        "actual",
        "deleted",
        "d_color_memo",
        "center",
        "isspace",
        "self",
        "index_of_move",
        "evap",
        "sortbooks",
        "search",
        "perm_count",
        "operator",
        "printl",
        "var",
        "indexes",
        "type_play",
        "ac",
        "xindex",
        "lim",
        "A1",
        "trap",
        "p2",
        "bl",
        "build",
        "presum",
        "isdroppable",
        "fu",
        "__to",
        "memmin",
        "lost",
        "perc_content",
        "sorted_list",
        "left_p",
        "diff",
        "crr",
        "maxVal",
        "fin4",
        "maxP",
        "RMQ",
        "beats",
        "hi",
        "parent_exist",
        "CC",
        "all_indx",
        "coor_set",
        "bookList",
        "up",
        "final",
        "sibs",
        "den1",
        "max_pre",
        "res1",
        "gap",
        "Hash_Function",
        "point",
        "totalAmountVisible",
        "sbs",
        "depth_real",
        "alpha",
        "maxTriangles",
        "lengths",
        "ad_fly_code",
        "elem",
        "is_prime",
        "x2",
        "tmp1",
        "books_dict",
        "take",
        "rank",
        "third",
        "depth_topo",
        "minimo",
        "cases",
        "unique",
        "distance",
        "clrmax",
        "item2",
        "gcd",
        "G",
        "removeRoot",
        "yi",
        "lst",
        "loc_list",
        "multi_itself",
        "dw",
        "make_submission",
        "freq",
        "lv",
        "replace_right",
        "z",
        "cur",
        "new_A",
        "mlimit",
        "M",
        "to_string",
        "parent",
        "MINP",
        "ij_count",
        "little",
        "isalpha",
        "div",
        "replace",
        "distinct",
        "dctPts",
        "y",
        "max_can_shoot",
        "laugh",
        "sum_of_i",
        "oper",
        "max_pwr",
        "sentence",
        "line1",
        "open_brackets",
        "missing_water_per_level",
        "solveFierceBattles",
        "init_array",
        "ik",
        "arrasc",
        "L1",
        "orda",
        "tot1",
        "sub",
        "restNums",
        "good",
        "m_max",
        "g2",
        "s0",
        "As",
        "age_1",
        "EDGELIST",
        "bruteforce",
        "dbl_x",
        "jk_ids",
        "binary_code_of_length_k",
        "pedps",
        "r4",
        "arr2",
        "is_sorted_with",
        "pnt",
        "first_step_of_j",
        "obj",
        "pat",
        "actual2",
        "r7",
        "zapr",
        "alf",
        "pyramid",
        "next_i",
        "islice",
        "arri",
        "numdict",
        "line",
        "NIL",
        "ic_max",
        "read_list",
        "odds",
        "val1",
        "ValueError",
        "visited",
        "getLCA",
        "recursive_climbStairs",
        "last",
        "collections",
        "dfq",
        "final_code",
        "in_j",
        "next_",
        "max_prod_right",
        "other_coler",
        "v_to_d",
        "total_multiplied_ages",
        "half",
        "maxnum",
        "warriors",
        "read_input",
        "deg",
        "__getitem__",
        "y47",
        "n_color_memo",
        "vPar",
        "room_number_list_sum",
        "tc",
        "arr_size",
        "toReturn",
        "ord",
        "less_than",
        "getSlices",
        "ew",
        "maxcl",
        "an",
        "MODULUS",
        "bin2dec",
        "ptr",
        "tw",
        "str_2n",
        "premax",
        "edy",
        "tour_v",
        "c2",
        "get_primes",
        "float",
        "dir",
        "thres",
        "nextSubAnsSet",
        "roop",
        "mystack",
        "height",
        "N",
        "qd",
        "word_pos",
        "curr_min",
        "highBuffer",
        "out",
        "josephus_survivor",
        "numOfSides",
        "element",
        "maxRight",
        "mask",
        "goodC",
        "a2",
        "F",
        "i",
        "ord_ar",
        "possible",
        "li",
        "sqrtofage",
        "txt",
        "uidx"
    ],
    "integer": [
        "123",
        "100001",
        "31",
        "10",
        "577",
        "70",
        "1000000",
        "109",
        "120",
        "14",
        "75",
        "45",
        "39367",
        "11",
        "1492993",
        "1800",
        "64",
        "97",
        "1297",
        "8",
        "40",
        "96",
        "18433",
        "629857",
        "1179649",
        "147457",
        "1337",
        "472393",
        "3889",
        "1500000",
        "998244353",
        "10000",
        "48",
        "50",
        "20",
        "10000000",
        "2593",
        "786433",
        "877",
        "32",
        "2917",
        "0",
        "906609",
        "3",
        "4",
        "63",
        "19",
        "1338",
        "9",
        "10369",
        "139969",
        "99",
        "475",
        "114514",
        "987",
        "100000000000000",
        "257",
        "37",
        "29",
        "1001",
        "73",
        "2147483647",
        "13",
        "839809",
        "1",
        "100000",
        "209953",
        "317",
        "16",
        "1153",
        "999000000999",
        "7",
        "1000000000",
        "1140",
        "110",
        "55",
        "50000",
        "5050",
        "17497",
        "163",
        "12",
        "65537",
        "487",
        "101",
        "80",
        "15",
        "12289",
        "17",
        "331777",
        "23",
        "300000",
        "316",
        "433",
        "3457",
        "9009",
        "52489",
        "26",
        "1_500_000",
        "99000099",
        "18",
        "200000000000000000",
        "300",
        "100",
        "9999000000009999",
        "1459",
        "5",
        "193",
        "99999999",
        "43996",
        "1000000001",
        "746497",
        "6",
        "769",
        "33",
        "90",
        "1218",
        "22",
        "597",
        "2",
        "25",
        "677",
        "762939453125",
        "570",
        "122",
        "99956644665999",
        "60",
        "995329",
        "9966006699",
        "1000000007",
        "1000",
        "65",
        "315",
        "10000000000000000000000000000000",
        "30"
    ],
