{
    "identifier": [
        "catalan_number",
        "b1",
        "small_nnum",
        "lds",
        "a1",
        "den",
        "li1",
        "anagram_lambda",
        "d_age",
        "check_Consecutive",
        "reverse_string_list",
        "list_split",
        "chr",
        "sub_str",
        "nums2",
        "variable",
        "bisect_left",
        "max_product",
        "rotate_left",
        "t",
        "find_tuples",
        "arr_size",
        "count_digits",
        "cn1",
        "profit_amount",
        "a",
        "dict_str1",
        "input_list",
        "phase",
        "res_ind",
        "iterable",
        "string_list_to_tuple",
        "maximum_segments",
        "counter",
        "removewords",
        "check_identical",
        "tuple_to_float",
        "x1",
        "find_Sum",
        "common_elements",
        "position_min",
        "pchar",
        "sum_of_digits",
        "MAX",
        "mp",
        "recursive_list_sum",
        "same_order",
        "n",
        "even",
        "first_even",
        "dict_depth",
        "text_match_three",
        "is_triangleexists",
        "mpis",
        "p1y",
        "row_st",
        "raw_heap",
        "get_unique",
        "num_fetch",
        "merge_dictionaries",
        "count_digs",
        "max_sum_list",
        "unique_Characters",
        "ele1",
        "row_ed",
        "min_difference",
        "max_volume",
        "trailing",
        "left_insertion",
        "chars",
        "circle_circumference",
        "find_angle",
        "alternate_elements",
        "sort_list",
        "colon_tuplex",
        "removezero_ip",
        "total_sum",
        "sd",
        "square_nums",
        "result_string",
        "queue",
        "prime",
        "first_non_repeating_character",
        "hq",
        "lens",
        "solve",
        "count_element_freq",
        "power_base_sum",
        "frequency",
        "check_list",
        "data_list",
        "__add__",
        "find_max_val",
        "findall",
        "LSA",
        "sum_nums",
        "heap_sort",
        "check_triplet",
        "directrix",
        "reverse_Array_Upto_K",
        "SA",
        "next_term",
        "longest_subseq_with_diff_one",
        "datetime",
        "is_samepatterns",
        "volume_cylinder",
        "return_sum",
        "sin",
        "odd_position",
        "x",
        "remove_tuple",
        "set_Right_most_Unset_Bit",
        "extract_singly",
        "camel_to_snake",
        "divSum",
        "div_list",
        "heap_queue_smallest",
        "abs",
        "frequency_Of_Smallest",
        "merge_dictionaries_three",
        "count_Rectangles",
        "plat_needed",
        "val",
        "acos",
        "is_majority",
        "df",
        "is_Product_Even",
        "table",
        "parallelogram_perimeter",
        "count_Pairs",
        "tuple_intersection",
        "enumerate",
        "number_ctr",
        "sqc",
        "new_list",
        "zigzag",
        "same_Length",
        "lateralsurface_cube",
        "zip_longest",
        "check_monthnumber",
        "zip_tuples",
        "amicable_numbers_sum",
        "sdict",
        "new_num",
        "access_key",
        "first_ludic",
        "rigthrange",
        "get_item",
        "diff",
        "pos",
        "sum_div",
        "models",
        "self",
        "floor_Max",
        "find_lcm",
        "find_ways",
        "maximum",
        "hamming_Distance",
        "cl",
        "starty",
        "Total_Hamming_Distance",
        "check_Equality",
        "get_Pairs_Count",
        "ord_list",
        "count_Num",
        "binary1",
        "out",
        "ind",
        "int",
        "flag_l",
        "remove_even",
        "check_monthnumb_number",
        "remove_parenthesis",
        "convert",
        "digit",
        "find_first_occurrence",
        "r2",
        "heapreplace",
        "Check_Vow",
        "eulerian_num",
        "extract_rear",
        "Average",
        "check_Odd_Parity",
        "all_unique",
        "space_count",
        "l3",
        "find_character",
        "sub_res",
        "other",
        "even_position",
        "divisors",
        "magic_square_test",
        "get_char",
        "angle_complex",
        "surfacearea_sphere",
        "T",
        "largest_triangle",
        "sum_Even",
        "assign_elements",
        "Sort",
        "tuples",
        "ct",
        "length",
        "exist",
        "re_order",
        "col_ed",
        "uglies",
        "l1",
        "find_Nth_Digit",
        "empty_dit",
        "excl_new",
        "mixed_list",
        "test_tup",
        "curr_price",
        "smallest_nums",
        "hexagonal_num",
        "shrink_fact",
        "filter_evennumbers",
        "next_list",
        "min_Swaps",
        "curr_term",
        "max",
        "find_demlo",
        "find_last_occurrence",
        "each",
        "polygons",
        "nlargest",
        "set",
        "toggle_string",
        "odd_nums",
        "extract_elements",
        "street",
        "words_ae",
        "cube_Sum",
        "check_literals",
        "middle",
        "check_Even_Parity",
        "snake_to_camel",
        "kth_element",
        "c_num",
        "first_Factorial_Divisible_Number",
        "multiply_elements",
        "num_list",
        "triangle_area",
        "idx",
        "validate",
        "maxPrime",
        "issubset",
        "surfacearea_cube",
        "rectangles",
        "min_sum_path",
        "h_age",
        "gold",
        "max_sum_pair_diff_lessthan_K",
        "colnum",
        "minimum_Length",
        "coins",
        "sum_in_Range",
        "join",
        "basesnum_coresspondingnum",
        "leftrange",
        "dif_Square",
        "is_Sub_Array",
        "min_length",
        "check_string",
        "concatenate_nested",
        "ctr",
        "dNo",
        "get_carol",
        "max_sum_subseq",
        "reverse_list_lists",
        "unique_product",
        "parabola_vertex",
        "last_digit",
        "my_matrix",
        "round_num",
        "mn",
        "total",
        "chunk_tuples",
        "amount",
        "deque",
        "max_sub_array_sum_repeated",
        "dealnnoy_num",
        "max_val",
        "area_tetrahedron",
        "radian",
        "end",
        "largest",
        "sum_negativenum",
        "month",
        "m2",
        "left_element",
        "remove_similar_row",
        "Sum",
        "check_abundant",
        "len",
        "season",
        "prev_list",
        "recur_gcd",
        "second_frequent",
        "mxm",
        "flatten_list",
        "words",
        "g",
        "remove_extra_char",
        "encode_list",
        "check_monthnumber_number",
        "ele",
        "arraynums",
        "dog_age",
        "get_equal",
        "values",
        "row",
        "find_Max_Num",
        "index_on_inner_list",
        "MSDBS",
        "m1",
        "replace_char",
        "reverse_vowels",
        "messg",
        "copy",
        "perimeter_pentagon",
        "tup2",
        "is_abundant",
        "find_rect_num",
        "rombus_area",
        "Find_Max",
        "shift_down",
        "find_kth",
        "is_sublist",
        "lucky_num",
        "sum_three_smallest_nums",
        "lenght",
        "similar_elements",
        "nsmallest",
        "nCr_mod_p",
        "multiples_of_num",
        "txt",
        "hashset",
        "digits",
        "count_even",
        "reverse",
        "dec_value",
        "find_Parity",
        "find_first_duplicate",
        "rotate_right",
        "prodOdd",
        "p6y",
        "name",
        "add_list",
        "filter_data",
        "split_Arr",
        "harmonic_sum",
        "re_arrange",
        "check_isosceles",
        "get_flip_with_starting_charcter",
        "char_order",
        "find_longest_conseq_subseq",
        "left_rotate",
        "heapq",
        "next",
        "__lt__",
        "any",
        "increasing_trend",
        "check_greater",
        "sum_difference",
        "XOR",
        "lcopy",
        "count_elim",
        "first_repeated_char",
        "sort_on_occurence",
        "find_Min_Diff",
        "amicables",
        "perimeter",
        "sum_Range_list",
        "split_two_parts",
        "subject_marks",
        "p",
        "find_substring",
        "keys",
        "yoffset",
        "data",
        "d1",
        "sort_mixed_list",
        "palindrome_lambda",
        "ranges",
        "div_even_odd",
        "group",
        "diameter",
        "change_date_format",
        "goldTable",
        "last",
        "max_subarray_product",
        "array_nums2",
        "el",
        "count_same_pair",
        "super_seq",
        "List",
        "maxAverageOfPath",
        "origy",
        "list_to_float",
        "final_profit",
        "string_to_tuple",
        "r1",
        "ugly",
        "fill_spaces",
        "empty_list",
        "is_Two_Alter",
        "func",
        "arr_len",
        "longest_increasing_subsequence",
        "divisor",
        "get_ludic",
        "move_num",
        "nums_set",
        "lst_to_string",
        "is_allowed_specific_char",
        "strt_val",
        "text_match_word",
        "is_Perfect_Square",
        "totalPairs",
        "tn_gp",
        "text1",
        "test_dict",
        "find_char_long",
        "is_woodall",
        "combinations_colors",
        "check_tuplex",
        "smallest_missing",
        "remove",
        "int_to_roman",
        "grid",
        "sort_tuple",
        "common_element",
        "arc_length",
        "res_j",
        "exchange_elements",
        "find_even_Pair",
        "hund4",
        "split_lowerstring",
        "replace_list",
        "sum_elements",
        "count_binary_seq",
        "numerical_characters",
        "cal_electbill",
        "answer",
        "div_of_nums",
        "divisible_by_digits",
        "text_match_zero_one",
        "lines",
        "largest_palindrome",
        "iidx",
        "get_char_count_array",
        "test_str",
        "smallest_Divisor",
        "test_tuple",
        "nums1",
        "array_nums",
        "find_remainder",
        "count_With_Odd_SetBits",
        "start",
        "KeyError",
        "units",
        "string_literals",
        "groupby",
        "pair",
        "new_str",
        "is_polite",
        "email",
        "NO_OF_CHARS",
        "remove_tuples",
        "max_Abs_Diff",
        "first_Repeated_Char",
        "maxx",
        "grouping_dictionary",
        "median_trapezium",
        "mt",
        "ngcd",
        "finditer",
        "sumofFactors",
        "min_jumps",
        "count_list",
        "A",
        "area",
        "shell_sort",
        "remove_lowercase",
        "mul",
        "nestedlist",
        "front_and_rear",
        "product_Equal",
        "ch",
        "second_smallest",
        "bases_num",
        "memo",
        "gcd",
        "array",
        "check_email",
        "y1",
        "largest_subset",
        "Pair",
        "binomial_probability",
        "flip_count",
        "get_height",
        "sqrt",
        "tn",
        "evenPair",
        "rear_extract",
        "result_list",
        "ctr_ele",
        "max_sum_rectangular_grid",
        "distance_lat_long",
        "difference",
        "next_Power_Of_2",
        "tuple_str",
        "isalpha",
        "Diff",
        "special_characters",
        "find_Min",
        "rombus_perimeter",
        "set_Bit_Number",
        "series_sum",
        "swapped",
        "string1",
        "rearange_string",
        "find_missing",
        "max_of_nth",
        "largest_pos",
        "sum_Natural",
        "find_long_word",
        "special",
        "sign",
        "is_Diff",
        "setBits",
        "_size",
        "even_fnc",
        "focus",
        "add_pairwise",
        "extract_freq",
        "count_common",
        "polar",
        "swap_List",
        "right_insertion",
        "sum1",
        "product",
        "push",
        "data_type",
        "word_len",
        "decimal_to_binary",
        "permute_string",
        "delim",
        "volume",
        "topbottom_surfacearea",
        "max_length",
        "ip",
        "is_Word_Present",
        "z",
        "diff_consecutivenums",
        "INT_BITS",
        "lst",
        "check_char",
        "primes",
        "right_up",
        "Tri_up",
        "min_result",
        "test_distinct",
        "merge_sort",
        "OrderedDict",
        "permutation_coefficient",
        "col_st",
        "get_Char",
        "replace_specialchar",
        "max_Prime_Factors",
        "j",
        "max_similar_indices",
        "count_no",
        "n_common_words",
        "index",
        "isdigit",
        "monthnum1",
        "big_sum",
        "concatenate_elements",
        "pos_count",
        "volume_cone",
        "volume_cuboid",
        "sorted",
        "first_odd",
        "result",
        "key",
        "parallelogram_area",
        "differ_At_One_Bit_Pos",
        "sum_of_alternates",
        "moddiv_list",
        "find_k_product",
        "count_Char",
        "get_First_Set_Bit_Pos",
        "text_match_string",
        "buck",
        "monthname1",
        "vertex",
        "binary",
        "elat",
        "cnt",
        "sub_set",
        "toggle_middle_bits",
        "tuple_to_set",
        "subjectmarks",
        "curr_sum",
        "str_part",
        "consecutive_duplicates",
        "extract_unique",
        "get_pairs_count",
        "first_Missing_Positive",
        "current_sum",
        "get",
        "fourth_Power_Sum",
        "swap_numbers",
        "placement",
        "check_Type_Of_Triangle",
        "line",
        "check_k_elements",
        "tup1",
        "size2",
        "squareofsum",
        "od_li",
        "range",
        "nct2",
        "remove_splchar",
        "closest",
        "overlapping",
        "get_Number",
        "p4x",
        "num_comm_div",
        "maximum_value",
        "get_odd_occurence",
        "base",
        "bisect_right",
        "max_ending_here",
        "heappop",
        "prime_num",
        "merge",
        "multiple_split",
        "replace_max_specialchar",
        "wind_chill",
        "mls",
        "lps",
        "q",
        "base2",
        "intersection_array",
        "h",
        "chain",
        "remove_spaces",
        "Odd_Length_Sum",
        "arr1",
        "isspace",
        "check_smaller",
        "dep",
        "maxOcc",
        "cheap_items",
        "previous_palindrome",
        "buckets",
        "ls",
        "startnum",
        "fact",
        "modular_inverse",
        "p1x",
        "sort_numeric_strings",
        "find_closet",
        "perimeter_triangle",
        "find_char",
        "centered_hexagonal_number",
        "right_child",
        "get_sum",
        "check_element",
        "issort_list",
        "rearrange_numbs",
        "origx",
        "y2",
        "get_gcd",
        "remove_odd",
        "perimeter_polygon",
        "Input",
        "test_duplicate",
        "pos_nos",
        "max_list",
        "remove_upper",
        "count_Substring_With_Equal_Ends",
        "No",
        "sumofsquares",
        "int_part",
        "text_match_wordz_middle",
        "count_Set_Bits",
        "tmp",
        "tee",
        "li",
        "remove_Occ",
        "ip_ind",
        "parallel_lines",
        "binomial_coeff",
        "Split",
        "jumps",
        "most_common",
        "n1",
        "st",
        "X",
        "find_gcd",
        "lcs_of_three",
        "nums_str",
        "sub_li",
        "heap_assending",
        "m",
        "nextN",
        "max_chain_length",
        "p5y",
        "mod",
        "zero_count",
        "min_length_list",
        "summ",
        "sample",
        "max_len_sub",
        "add_nested_tuples",
        "cost",
        "lowercase_characters",
        "sorted1",
        "maximum_Sum",
        "rh",
        "SumOfPrimeDivisors",
        "match_num",
        "S",
        "all_Bits_Set_In_The_Given_Range",
        "my_list",
        "noOfZeroes",
        "count_tuplex",
        "repititions",
        "list3",
        "Z",
        "extract_min_max",
        "average_tuple",
        "count_element_in_list",
        "msb",
        "str_len",
        "get_Inv_Count",
        "larg_nnum",
        "frequency_lists",
        "diameter_circle",
        "new_tuple",
        "item_list",
        "extract_even",
        "str1",
        "cube_nums",
        "list_nums",
        "find_Index",
        "tup",
        "get_noOfways",
        "num_set",
        "factorial",
        "maxi",
        "last_Digit_Factorial",
        "is_palindrome",
        "heapify",
        "len_log",
        "lateralsurface",
        "max_sum_of_three_consecutive",
        "degree_radian",
        "patterns",
        "make_flip",
        "find_triplet_array",
        "s_result",
        "sum_Of_Subarray_Prod",
        "matrix",
        "opposite_Signs",
        "sm",
        "odd_Num_Sum",
        "remove_kth_element",
        "top",
        "sentence",
        "B",
        "equilibrium_index",
        "prod",
        "ditionary",
        "average",
        "xs",
        "minLength",
        "check_expression",
        "running_count",
        "fromkeys",
        "rawheap",
        "filter_oddnumbers",
        "reversed",
        "year",
        "int_val",
        "tuple",
        "get_product",
        "min_ending_here",
        "surcharge",
        "round_up",
        "get_Pos_Of_Right_most_Set_Bit",
        "remove_lower",
        "reminder",
        "substring",
        "count_char",
        "get_Odd_Occurrence",
        "number",
        "parabola_directrix",
        "nth_super_ugly_number",
        "get_median",
        "count_Unset_Bits",
        "string",
        "min_Jumps",
        "right",
        "N",
        "index_minimum",
        "maxList",
        "right_height",
        "sum_list",
        "pairs",
        "dict2",
        "right_down",
        "is_Isomorphic",
        "swap",
        "word",
        "negative_count",
        "concatenate_strings",
        "defaultdict",
        "fifth_Power_Sum",
        "replace",
        "smallest",
        "specified_element",
        "square_Sum",
        "count_integer",
        "col",
        "max_sum",
        "multiply_num",
        "count_vowels",
        "longest_common_subsequence",
        "sum_num",
        "char_frequency",
        "dict_filter",
        "c0",
        "min_Ops",
        "poly",
        "step",
        "remove_empty",
        "slope",
        "adjac",
        "perfect_squares",
        "search",
        "sort_counter",
        "sum_digits_twoparts",
        "object",
        "most_occurrences",
        "is_key_present",
        "o",
        "lbs",
        "upper",
        "p2y",
        "collections",
        "zip",
        "count_ways",
        "element",
        "group_element",
        "surface_Area",
        "move_first",
        "bell",
        "text_lowercase_underscore",
        "subs",
        "validity_triangle",
        "check_date",
        "rownum",
        "binomial_coeffi",
        "most_common_elem",
        "k",
        "price",
        "no_duplicate",
        "mul_consecutive_nums",
        "from_iterable",
        "incl",
        "upper_ctr",
        "tuple_str_int",
        "max_sub_array_sum",
        "discriminant_value",
        "unique_sublists",
        "items",
        "is_not_prime",
        "long_words",
        "ar",
        "clear_tuple",
        "extract_quotation",
        "sqb",
        "s1",
        "min_k",
        "is_decimal",
        "nth_nums",
        "count_Rotation",
        "date",
        "lower_ctr",
        "mutiple_tuple",
        "find_Extra",
        "string_length",
        "isupper",
        "ord",
        "odd_values_string",
        "month_season",
        "division_elements",
        "c1",
        "smallest_multiple",
        "Find_Min_Length",
        "ev_li",
        "count_Fac",
        "Tri_down",
        "rgb_to_hsv",
        "count",
        "replace_blank",
        "minimum",
        "num1",
        "roman_num",
        "surfacearea_cylinder",
        "merged",
        "remove_matching_tuple",
        "remove_multiple_spaces",
        "max_run_uppercase",
        "remove_nested",
        "check_none",
        "pair_wise",
        "sset",
        "min_list",
        "subset",
        "counts",
        "child",
        "sample_nam",
        "K",
        "elem",
        "leading",
        "second_string",
        "smartNumber",
        "armstrong_number",
        "lateralsurface_cone",
        "sector_area",
        "terms",
        "first_repeated_word",
        "check_subset",
        "arr2",
        "current_element",
        "add_K_element",
        "min_val",
        "my_dict",
        "max_char",
        "bell_Number",
        "idxn",
        "check_permutation",
        "expensive_items",
        "decreasing_trend",
        "octal_To_Decimal",
        "sequential_search",
        "type",
        "area_polygon",
        "parenthese",
        "add_str",
        "endnum",
        "next_smallest_palindrome",
        "zip_list",
        "get_perrin",
        "s2",
        "result1",
        "odd_bit_set_number",
        "min_count",
        "string_to_list",
        "jacobsthal_num",
        "tuple_list",
        "max_count",
        "check_monthnum",
        "start_withp",
        "dp",
        "check_K",
        "num",
        "remove_list_range",
        "even_num",
        "ans",
        "arclength",
        "radius",
        "convert_list_dictionary",
        "getsizeof",
        "check_min_heap",
        "combine_lists",
        "join_tuples",
        "dlist",
        "string2",
        "and_tuples",
        "b",
        "pow",
        "is_Power_Of_Two",
        "sum_range",
        "v",
        "extract_symmetric",
        "text_match_one",
        "multiply_int",
        "ascii_value_string",
        "are_Rotations",
        "sum_of_square",
        "remove_duplic_list",
        "two_unique_nums",
        "rearrange_bigger",
        "count_odd",
        "lateralsuface_cylinder",
        "index_multiplication",
        "area_pentagon",
        "char2",
        "remove_uppercase",
        "prefix",
        "extract_column",
        "search_literal",
        "ASCII_SIZE",
        "sum_column",
        "geometric_sum",
        "nth_items",
        "odd_Equivalent",
        "decimal_To_Binary",
        "occu",
        "bitwise_xor",
        "ludics",
        "right_element",
        "first",
        "li2",
        "base1",
        "find_Max_Len_Even",
        "parity",
        "sort_String",
        "text",
        "loss_amount",
        "elon",
        "number_of_substrings",
        "maxsize",
        "exit",
        "find_Odd_Pair",
        "min_product_tuple",
        "hund1",
        "top_four",
        "sequence",
        "fibonacci",
        "list_tuple",
        "cos",
        "fctr",
        "compile",
        "sum_digits",
        "res_k",
        "counting_sort",
        "pack_consecutive_duplicates",
        "count_variable",
        "index_no",
        "res_num",
        "tri",
        "swapcase",
        "max_result",
        "charlist",
        "phrase",
        "deciNum",
        "find_lists",
        "check_String",
        "rotations",
        "left_child",
        "sort",
        "square_perimeter",
        "minList",
        "radians",
        "dict_str2",
        "elt",
        "trim_tuple",
        "union_elements",
        "min_Operations",
        "check_equilateral",
        "floor",
        "find_lucas",
        "url",
        "is_valid_URL",
        "even_Power_Sum",
        "floor_Min",
        "log2",
        "is_valid_parenthese",
        "roman_to_int",
        "compute_Last_Digit",
        "extract_date",
        "find_exponentio",
        "find_adverb_position",
        "test_list1",
        "sum2",
        "test_list",
        "radian_degree",
        "flatten",
        "min_coins",
        "find_Rotations",
        "median",
        "value",
        "Convert",
        "g2",
        "nct1",
        "max_so_far",
        "leap",
        "exp",
        "ascii_value",
        "all",
        "match",
        "reverse_words",
        "remove_column",
        "all_Characters_Same",
        "sum_average",
        "areEquivalent",
        "is_coprime",
        "itemgetter",
        "oddPair",
        "find_Average_Of_Cube",
        "mi",
        "is_undulating",
        "re",
        "msis",
        "ncr_modp",
        "No_of_cubes",
        "combinations_with_replacement",
        "str_list",
        "decimal",
        "split",
        "stdata",
        "test_tup2",
        "bin",
        "round_and_sum",
        "startx",
        "size",
        "avg_calc",
        "count_Divisors",
        "sum_gp",
        "count_reverse_pairs",
        "frequency_Of_Largest",
        "final",
        "set_left_most_unset_bit",
        "find_adverbs",
        "decimal_to_Octal",
        "even_ele",
        "remove_all_spaces",
        "is_num_decagonal",
        "result_max",
        "e",
        "imbalance",
        "decode_list",
        "vowels",
        "max_aggregate",
        "sum_Square",
        "newman_prime",
        "coin_change",
        "itertools",
        "heappush",
        "x3",
        "remove_index",
        "sectorarea",
        "ValueError",
        "find_minimum_range",
        "average_Even",
        "setdefault",
        "check_type",
        "mul_even_odd",
        "count_Primes_nums",
        "cummulative_sum",
        "get_max_sum",
        "left",
        "_",
        "pop",
        "min_flip_to_make_string_alternate",
        "count_right",
        "sys",
        "set_to_tuple",
        "freq",
        "count_Substrings",
        "get_Position",
        "tuplex",
        "w",
        "remove_char",
        "greater_specificnum",
        "find_peak_util",
        "high",
        "__contains__",
        "find_literals",
        "max_length_list",
        "first_Digit",
        "chkList",
        "split_upperstring",
        "tuple_int_str",
        "filter",
        "volume_cube",
        "count_left",
        "list1",
        "prev",
        "count_Occurrence",
        "check_monthnum_number",
        "stop_val",
        "diameterSquare",
        "x2",
        "math",
        "re_arrange_tuples",
        "binary_search",
        "prod_Square",
        "windchill",
        "remove_dirty_chars",
        "max_Product",
        "min_cost",
        "low",
        "nCr",
        "min_of_two",
        "log",
        "bool",
        "deepcopy",
        "find_fixed_point",
        "p3y",
        "left_sum",
        "V",
        "title",
        "sum",
        "split_list",
        "check_str",
        "str_to_tuple",
        "test_list2",
        "alphabets",
        "cal_sum",
        "maximize_elements",
        "P",
        "get_inv_count",
        "check_IP",
        "ordd",
        "sum_Of_Series",
        "mean",
        "is_Sum_Of_Powers_Of_Two",
        "uppercase_characters",
        "check_substring",
        "tot",
        "_sum",
        "fac",
        "babylonian_squareroot",
        "sub",
        "monthname3",
        "check_valid",
        "merge_dict",
        "pattern",
        "even_bit_toggle_number",
        "float_sort",
        "C",
        "is_Even",
        "freq_count",
        "count_char_position",
        "common_prefix",
        "n2",
        "input",
        "array_3d",
        "rectangle_perimeter",
        "surfacearea_cuboid",
        "listval",
        "group_keyvalue",
        "excl",
        "pq",
        "power",
        "current_item",
        "listx",
        "max_value",
        "noprofit_noloss",
        "left_height",
        "prodEven",
        "sublist",
        "p6x",
        "diff_even_odd",
        "flatten_tuple",
        "ptr",
        "find_Max",
        "find_max",
        "found",
        "res_i",
        "sorted_dict",
        "extend",
        "check_Triangle",
        "sale_amount",
        "listify_list",
        "Extract",
        "xoffset",
        "sqrt_root",
        "sum_of_odd_Factors",
        "last_Digit",
        "Repeat",
        "insert_element",
        "sub_lists",
        "get_lcm",
        "even_nums",
        "polar_rect",
        "text_uppercase_lowercase",
        "char",
        "inversion_elements",
        "y3",
        "max_profit",
        "bisect",
        "cur",
        "rencontres_number",
        "test_tup1",
        "mid",
        "find_peak",
        "intersection_nested_lists",
        "remove_replica",
        "count_Squares",
        "max1",
        "is_tree_balanced",
        "even_binomial_Coeff_Sum",
        "check_tuples",
        "median_numbers",
        "tuplex_colon",
        "max_digit",
        "common_prefix_util",
        "freq_element",
        "uniq_items",
        "p3x",
        "stack",
        "numstr",
        "capitalize",
        "lst2",
        "binary_to_decimal",
        "factors",
        "res_list",
        "inv_count",
        "minEle",
        "large_product",
        "tuple_size",
        "repeated",
        "is_lower",
        "even_bit_set_number",
        "check_Concat",
        "generate_matrix",
        "text_match_two_three",
        "b2",
        "big_diff",
        "get_max_occuring_char",
        "sd_calc",
        "tan",
        "sum_fact2",
        "count_X",
        "endy",
        "find_length",
        "sum_Pairs",
        "wrd",
        "find_Min_Sum",
        "volume_tetrahedron",
        "maxLength",
        "Y",
        "dict",
        "dnumre",
        "list_num",
        "dct",
        "newList",
        "extract_missing",
        "check_alphanumeric",
        "current",
        "aux",
        "countval",
        "right_rotate",
        "root",
        "largest_neg",
        "Find_Min",
        "num3",
        "rect",
        "count_charac",
        "vow_list",
        "bin_coff",
        "is_octagonal",
        "i",
        "pi",
        "neg_count",
        "map",
        "left_Rotate",
        "k_smallest_pairs",
        "check_value",
        "sub_list",
        "text_match_wordz",
        "re_arrange_array",
        "merged_dict",
        "extract_max",
        "largest_nums",
        "count_samepair",
        "sum_series",
        "combinations_list",
        "l",
        "flag_n",
        "list_index",
        "ap_sum",
        "side",
        "max_difference",
        "sort_list_last",
        "are_Equal",
        "add_consecutive_nums",
        "test_three_equal",
        "look_up",
        "get_total_number_of_sequences",
        "numbers",
        "node",
        "find_Element",
        "find",
        "mcl",
        "text_match",
        "update",
        "dist",
        "lobb_num",
        "extract_nth_element",
        "slat",
        "str",
        "octalNum",
        "L",
        "strip",
        "access_elements",
        "find_Divisor",
        "find_Volume",
        "concatenate_tuple",
        "max_sum_increasing_subsequence",
        "d2",
        "elements",
        "cmath",
        "line2",
        "sum_Odd",
        "no_of_subsequences",
        "end_num",
        "times",
        "eq",
        "count_duplic",
        "tc",
        "matrix_to_list",
        "add_dict",
        "r",
        "flag",
        "fctrsum",
        "heap",
        "smallest_num",
        "cn",
        "remove_duplicate",
        "tetrahedral_number",
        "res",
        "lis",
        "nums",
        "list_data",
        "iter",
        "min_of_three",
        "even_or_odd",
        "check_integer",
        "next_Perfect_Square",
        "pass_validity",
        "first_Element",
        "count_chars",
        "array_nums1",
        "find_Min_Swaps",
        "heap_queue_largest",
        "res_dict",
        "highest_Power_of_2",
        "list",
        "float_to_tuple",
        "odd_Days",
        "combinations",
        "line1",
        "slon",
        "append",
        "max_height",
        "isinstance",
        "find_rotation_count",
        "assign_freq",
        "road_rd",
        "new_length",
        "ele2",
        "max_of_three",
        "sum_even_and_even_index",
        "pancake_sort",
        "groups",
        "max_sum_increasing_subseq",
        "add_string",
        "substract_elements",
        "tuple_to_int",
        "is_nonagonal",
        "intersection",
        "sum_Of_product",
        "add_lists",
        "get_key",
        "len_complex",
        "capital_words_spaces",
        "texts",
        "find_longest_repeating_subseq",
        "DP",
        "strr",
        "degree",
        "p4y",
        "max_of_two",
        "min",
        "dict1",
        "capitalize_first_last_letters",
        "get_coordinates",
        "last_Two_Digits",
        "find_Product",
        "find_star_num",
        "check_last",
        "gap",
        "find_equal_tuple",
        "rem",
        "bell_number",
        "Node",
        "check_occurences",
        "find_platform",
        "char1",
        "monthnum3",
        "diagnalLengthSquare",
        "sum_positivenum",
        "rom_val",
        "colors",
        "check_subset_list",
        "__init__",
        "count_Digit",
        "complex",
        "count_range_in_list",
        "gaps",
        "is_num_keith",
        "pset",
        "count_Odd_Squares",
        "MSIBS",
        "surfacearea_cone",
        "RADIX",
        "sum_range_list",
        "Ip",
        "move_zero",
        "breakSum",
        "endx",
        "result2",
        "get_pell",
        "max_product_tuple",
        "binary_to_integer",
        "volume_sphere",
        "num2",
        "maxvalue",
        "incr",
        "ntimes_list",
        "second_large",
        "gen",
        "dig_let",
        "remove_Char",
        "extract_string",
        "add_tuple",
        "p2x",
        "drop_empty",
        "maxlen",
        "f",
        "replace_spaces",
        "remove_words",
        "s",
        "ceil",
        "average_Odd",
        "find_dissimilar",
        "get_maxgold",
        "extract_values",
        "students",
        "count_occurance",
        "length_Of_Last_Word",
        "num_position",
        "merge_sorted_list",
        "area_trapezium",
        "sorted_models",
        "lcm",
        "remove_elements",
        "extract_index_list",
        "dup_items",
        "marks",
        "rev",
        "check_monthnumb",
        "dic_data",
        "sum_digits_single",
        "log10",
        "text_starta_endb",
        "p5x",
        "word_counts",
        "sort_matrix",
        "heap_replace",
        "find_Diff",
        "lnum",
        "sum_even_odd",
        "format",
        "l2",
        "odd",
        "multiply_list",
        "toggle_F_and_L_bits",
        "No_of_Triangle",
        "multi_list",
        "islower",
        "binomial_Coeff",
        "solution",
        "count_Intgral_Points",
        "count_Hexadecimal",
        "count_alpha_dig_spl",
        "check",
        "count_first_elements",
        "repeat_tuples",
        "next_element",
        "syb",
        "powerOf2",
        "parabola_focus",
        "add",
        "sum_Of_Primes",
        "size1",
        "sl",
        "str_to_list",
        "item",
        "tup_string",
        "Find_Max_Length",
        "stringlist",
        "chinese_zodiac",
        "find_Digits",
        "pair_OR_Sum",
        "remove_datatype",
        "list2",
        "group_tuples",
        "find_Points",
        "sum_fact",
        "count_bidirectional",
        "angle",
        "maxEle",
        "max_occurrences",
        "check_Validity",
        "increment_numerics",
        "interleave_lists",
        "dict3",
        "last_occurence_char",
        "height",
        "count_pairs",
        "modified_encode",
        "c",
        "sort_by_dnf",
        "swap_count",
        "remove_whitespaces",
        "days",
        "removals",
        "multiple_to_single",
        "float",
        "jacobsthal_lucas",
        "clear",
        "expected",
        "iSize",
        "tuple1",
        "M",
        "unique_Element",
        "sort_sublists",
        "occurance_substring",
        "common_in_nested_lists",
        "lateralsurface_cuboid",
        "round",
        "remove_length",
        "take_L_and_F_set_bits",
        "calculate_polygons",
        "is_odd",
        "neg_nos",
        "count_map",
        "dt",
        "sample_names",
        "alist",
        "is_Monotonic",
        "rectangle_area",
        "a2",
        "currlen",
        "closest_num",
        "count_unset_bits",
        "min_Num",
        "sort_dict_item",
        "str2",
        "find_ind",
        "monthname2",
        "seq_nums",
        "actual_cost",
        "sqa",
        "find_First_Missing",
        "rev_num",
        "limit",
        "does_Contain_B",
        "set_middle_bits",
        "dec",
        "lower",
        "mul_list",
        "maximum_product",
        "adjacent_num_product",
        "Counter",
        "mx",
        "count_no_of_ways",
        "regex",
        "add_dict_to_tuple",
        "max_path_sum",
        "remainder",
        "check_distinct",
        "Check_Solution",
        "temp",
        "surfacearea",
        "tn_ap",
        "find_combinations",
        "discriminant",
        "Seq_Linear",
        "Sum_of_Inverse_Divisors",
        "y",
        "tuple_to_dict",
        "out_of_place",
        "lh",
        "lst1",
        "digit_distance_nums",
        "d",
        "newch",
        "tuple_modulo",
        "modular_sum",
        "R",
        "B_Number",
        "positive_count",
        "is_subset_sum",
        "position_max",
        "monthnum2",
        "is_upper",
        "is_subset",
        "get_Min_Squares",
        "result_min",
        "otherside_rightangle",
        "move_last",
        "lists",
        "ChainMap",
        "radix_sort",
        "inner",
        "new_words",
        "toporbottomarea",
        "remove_negs",
        "arr",
        "comb_sort",
        "dig"
    ],
    "integer": [
        "11",
        "4",
        "30",
        "400",
        "21",
        "3000",
        "180",
        "10",
        "19",
        "26",
        "900",
        "90",
        "1000",
        "15",
        "20",
        "100",
        "100000",
        "9",
        "8",
        "16",
        "256",
        "50",
        "1000000007",
        "1",
        "12",
        "6",
        "500",
        "240",
        "7",
        "0",
        "360",
        "200",
        "2000",
        "526",
        "130",
        "25",
        "22",
        "75",
        "45",
        "1000000",
        "60",
        "32",
        "2147483648",
        "120",
        "5",
        "3",
        "40",
        "35",
        "2"
    ],
    "module_identifier": [
        "defaultdict",
        "maxsize",
        "chain",
        "deque",
        "cmath",
        "tan",
        "datetime",
        "pi",
        "eq",
        "OrderedDict",
        "combinations",
        "heapq",
        "tee",
        "cos",
        "sin",
        "Counter",
        "heappop",
        "array",
        "math",
        "groupby",
        "radians",
        "collections",
        "itemgetter",
        "sys",
        "copy",
        "zip_longest",
        "merge",
        "re",
        "itertools",
        "heappush",
        "acos",
        "combinations_with_replacement",
        "operator",
        "bisect",
        "deepcopy"
    ],
    "string": [
        "\"IV\"",
        "'Yes, the entered number is greater than those in the array'",
        "\"AEIOUaeiou\"",
        "\":\"",
        "'June'",
        "'i'",
        "'e'",
        "''",
        "'April'",
        "'accepted'",
        "\"x = \"",
        "\"}\"",
        "'X'",
        "'z'",
        "\"EVEN\"",
        "'Road$'",
        "\"All tuples have same length\"",
        "\"Accept\"",
        "'E'",
        "'Not matched!'",
        "'Found a match!'",
        "' '",
        "'August'",
        "'MSP'",
        "\"Not Equal\"",
        "'[A-Z][^A-Z]*'",
        "'Dragon'",
        "\" \"",
        "'^[a-z0-9]+[\\._]?[a-z0-9]+[@]\\w+[.]\\w{2,3}$'",
        "r'\"(.*?)\"'",
        "\"XC\"",
        "'String must have 1 upper case character.'",
        "\"{2,6}\\\\b([-a-zA-Z0-9@:%\"",
        "'[A-Z]+[a-z]+$'",
        "')'",
        "\"Input must be bigger than 0!\"",
        "\"July\"",
        "\"October\"",
        "'Monkey'",
        "'['",
        "\"_\"",
        "\"[a-zA-Z0-9@:%._\\\\+~#?&//=]\"",
        "'V'",
        "'summer'",
        "r\"\\b\\w{4,}\\b\"",
        "'t'",
        "\"ODD\"",
        "'ab{3}?'",
        "'fox'",
        "\"[ ,.]\"",
        "\"No solution\"",
        "r\"\"\"^[0-9]+(\\.[0-9]{1,2})?$\"\"\"",
        "'\\0'",
        "\"CD\"",
        "\"no real solution\"",
        "\"._\\\\+~#?&//=]*)\"",
        "'[A-Z]'",
        "'December'",
        "'price'",
        "'(.)([A-Z][a-z]+)'",
        "'0'",
        "'A'",
        "'u'",
        "r\"^5\"",
        "\"Two solutions\"",
        "'{'",
        "']'",
        "\"Odd Parity\"",
        "r'(\\d{4})-(\\d{1,2})-(\\d{1,2})'",
        "\"All tuples do not have same length\"",
        "r\"[A-Z]\"",
        "\"No\"",
        "\"\\s\"",
        "r'\\1_\\2'",
        "'color'",
        "\"((http|https)://)(www.)?\"",
        "\"string starts with the given substring\"",
        "\"D\"",
        "'November'",
        "\"March\"",
        "'[a-zA-z0-9]$'",
        "'^\\w+'",
        "'January'",
        "'February'",
        "'\\Bz\\B'",
        "' +'",
        "r'[^a-zA-Z0-9.]'",
        "'None'",
        "\"Discard\"",
        "'4'",
        "r\"[a-z]\"",
        "'^[aeiouAEIOU][A-Za-z0-9_]*'",
        "'Rat'",
        "'String must have 1 number.'",
        "\"Invalid Email\"",
        "\"Equal\"",
        "'D'",
        "'([a-z0-9])([A-Z])'",
        "'%'",
        "'{2,}'",
        "r\"[, .!?]\"",
        "'; |, |\\*|\\n'",
        "'\\\\3-\\\\2-\\\\1'",
        "'The quick brown fox jumps over the lazy dog.'",
        "'YES'",
        "\"2 solutions\"",
        "\"Even\"",
        "\"1 solution\"",
        "\"Valid IP address\"",
        "\"I\"",
        "', '",
        "'No'",
        "\"Even Parity\"",
        "\"0b\"",
        "\"February\"",
        "\"[0-9]\"",
        "'July'",
        "'[0-9]'",
        "'*'",
        "\"-Inf\"",
        "r\" ?\\([^)]+\\)\"",
        "\"XL\"",
        "'NO'",
        "'I'",
        "'2'",
        "'-inf'",
        "'ab?'",
        "r'^[a-z]$|^([a-z]).*\\1$'",
        "'Z'",
        "\"Non Linear Sequence\"",
        "'a'",
        "'Hare'",
        "r\"\\1 \\2\"",
        "'Ox'",
        "'\\.[0]*'",
        "'''^(25[0-5]|2[0-4][0-9]|[0-1]?[0-9][0-9]?)\\.( \r\n\t\t\t25[0-5]|2[0-4][0-9]|[0-1]?[0-9][0-9]?)\\.( \r\n\t\t\t25[0-5]|2[0-4][0-9]|[0-1]?[0-9][0-9]?)\\.( \r\n\t\t\t25[0-5]|2[0-4][0-9]|[0-1]?[0-9][0-9]?)$'''",
        "'ab+?'",
        "'March'",
        "'('",
        "'Rooster'",
        "\"None\"",
        "\"M\"",
        "\"Yes\"",
        "'Python Exercises'",
        "'spring'",
        "\"[\"",
        "'Valid string.'",
        "\"{\"",
        "\"entered string isnt a substring\"",
        "r\"\\w+ly\"",
        "\"June\"",
        "\"\\A\"",
        "\"No solutions\"",
        "'d'",
        "'}'",
        "'Dog'",
        "\"December\"",
        "'9'",
        "\")\"",
        "\"Obtuse-angled Triangle\"",
        "\"-1\"",
        "'6'",
        "'o'",
        "\"string doesnt start with the given substring\"",
        "'Rd.'",
        "\"V\"",
        "\"+-\"",
        "r\"(\\w)([A-Z])\"",
        "\"-\"",
        "'Horse'",
        "\"[$#@]\"",
        "'\\d+'",
        "'Pig'",
        "'M'",
        "\"not accepted\"",
        "'[\\W_]+'",
        "\", y = \"",
        "r\"\\b\\w{3,5}\\b\"",
        "\"November\"",
        "\"(P\\w+)\\W(P\\w+)\"",
        "'L'",
        "'...'",
        "'sheep'",
        "'\\w*z.\\w*'",
        "'\\w+'",
        "'String length should be atleast 8.'",
        "\"one solution\"",
        "\"May\"",
        "\"April\"",
        "'September'",
        "'October'",
        "'[a-z][^a-z]*'",
        "\"Not Possible\"",
        "'String must have 1 lower case character.'",
        "'No, entered number is less than those in the array'",
        "\"X\"",
        "'Yes'",
        "r\"[0-9]\"",
        "\"(\"",
        "\"Odd\"",
        "'inf'",
        "\"No pairs exists\"",
        "'8'",
        "\"0123456789\"",
        "'Tiger'",
        "\"\"",
        "\"Augest\"",
        "\"[a-z]\"",
        "r'/(\\d{4})/(\\d{1,2})/(\\d{1,2})/'",
        "\"[ae]\\w+\"",
        "'\\w+\\S*$'",
        "\"Acute-angled Triangle\"",
        "\"CM\"",
        "'ab*?'",
        "'%d-%d: %s'",
        "r\"\\b\\w{5}\\b\"",
        "'May'",
        "'_'",
        "\"Invalid Input\"",
        "\"Linear Sequence\"",
        "\"Invalid\"",
        "'^[a-z]+_[a-z]+$'",
        "\"{2,256}\\\\.[a-z]\"",
        "\"September\"",
        "\"Right-angled Triangle\"",
        "'a.*?b$'",
        "\"Valid Email\"",
        "'ab{2,3}'",
        "\"January\"",
        "\"Input is not an integer!\"",
        "'1'",
        "\"C\"",
        "'autumn'",
        "\"Invalid IP address\"",
        "'Matched!'",
        "\"\\d+\"",
        "'.'",
        "'s'",
        "'winter'",
        "\"Valid\"",
        "\"[A-Z]\"",
        "'[a-z]'",
        "r\".*[0-9]$\"",
        "'Snake'",
        "\"aeiouAEIOU\"",
        "\"IX\"",
        "'C'",
        "r'\\s+'",
        "\"L\"",
        "\"]\"",
        "'Not Matched!'"
    ],
    "float": [
        "4.0",
        "13.12",
        "8.45",
        "0.6215",
        "5.26",
        "162.50",
        "0.5",
        "11.37",
        "0.16",
        "0.0",
        "1.3",
        "255.0",
        "2.0",
        "1.0",
        "10.5",
        "6371.01",
        "2.60",
        "0.3965",
        "3.1415",
        "3.25"
    ]
}